entities={
    "cscw106": {
        "title": "Outnumbered but Well-Spoken: Female Commenters in the New York Times",
        "abstract": "Using eight months of online comments on New York Times articles, we find that only 28% of commenters of identifiable gender are female, but that their comments receive more recommendations from other readers. Comments from women are more common on forums about parenting, fashion, and health, and on articles written by women. The number of recommendations comments from women receive is positively correlated with the percentage of men on a forum, and the number of recommendations men receive is negatively correlated with the percentage of men on a forum. Female commenters are more likely to remain anonymous and anonymous commenters receive fewer recommendations. Male and female commenters differ in their choice of topics to emphasize,  backgrounds, and language; we find three specific examples in responses to articles about sexual assault, contraception, and farm subsidies. We discuss the implications of these gender differences for democratic discourse and suggest ways to increase gender parity.",
        "keywords": "",
        "authors": [
            {
                "name": "Emma Pierson"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw118": {
        "title": "From \"nobody cares\" to \"way to go!\": A Design Framework for Social Sharing in Personal Informatics",
        "abstract": "Sharing personally collected data with others in social awareness streams is increasingly popular in both research and commercial applications. Prior work has identified several barriers to use as well as discrepancies between designer goals and how these features are used in practice. We develop a framework for evaluating these systems based on an extensive review of prior literature. We demonstrate the value of this framework by analyzing physical activity sharing on Twitter, coding 4,771 tweets and their responses and gathering 444 reactions from 97 potential tweet recipients, learning that specific user-generated content leads to more responses and is better received by the post audience. We conclude by extending our findings to other sharing problems and discussing the value of our design framework.",
        "keywords": "",
        "authors": [
            {
                "name": "Daniel A Epstein"
            },
            {
                "name": "Bradley H Jacobson"
            },
            {
                "name": "Elizabeth Bales"
            },
            {
                "name": "David W McDonald"
            },
            {
                "name": "Sean A Munson"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw121": {
        "title": "Coordination-artifacts suiting: When plans are in the midst of ordering systems",
        "abstract": "This paper addresses the received understanding of the status of plans in cooperative work -- that is, artefacts that anticipate future ways of performing activities, to challenge the received understanding of the plan's capacity to anticipate interdependencies as an immutable feature of plans. We propose conceptualizing the plan's capacity to anticipate interdependencies at work as an emergent, distributed and artifact-mediated activity that might be uncovered studying plans, planning and the plans application as work objects and activities occurring within a multiplicity of coordinative artifacts and protocols. This way we can expand our knowledge on how the plans anticipation is maintained in changing environments to support work coordination and we might support designers of computer-supported cooperative work (CSCW)' efforts for the design of CSCW systems.",
        "keywords": "",
        "authors": [
            {
                "name": "ilaria redaelli"
            },
            {
                "name": "antonella carassa"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw129": {
        "title": "An Agent for Deception Detection in Discussion Based Environments",
        "abstract": "Extensive use of computerized forums and chat-rooms provides a modern venue for deception. We propose introducing an agent to assist in detecting and incriminating a deceptive participant. We designed a game, where deception in a text based discussion environment occurs. In this game several participants attempt to collectively detect a deceptive member. We compose an automated agent which participates in this game as a regular player. The goal of the agent is to detect the deceptive participant and alert other members, without raising suspicion itself.  We use machine learning on the data collected from human players to design this agent.  Extensive evaluation of our agent shows that it succeeds in raising the players collective success rate in catching the deceptive player.",
        "keywords": "",
        "authors": [
            {
                "name": "Amos Azaria"
            },
            {
                "name": "Ariella Richardson"
            },
            {
                "name": "Sarit Kraus"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw134": {
        "title": "PaperChains: Dynamic Sketch+Voice Annotations",
        "abstract": "In this paper we present a novel interface for collaborative creation of evolving audio-visual documents. PaperChains allows users to sketch on paper and then augment with digital audio, allowing both the physical and digital objects to evolve simultaneously over time. The technique focuses on affordability and accessibility in its design, using standard cameraphones and telephone connections, allowing it to be used in regions where literacy, technological experience and data connections cannot necessarily be taken for granted. The main use-case that we focus on here is for collaborative storytelling, an area which has been well studied and previously proven to be of value in resource constrained environments. To investigate the approach in these contexts, we undertook two usability evaluations in India and South Africa. Results from these investigations indicate users' ability to both create and interpret stories using PaperChains, as well as demonstrating high overall usability and enjoyment. We end with a discussion of the implications of our design and opportunities for use in other contexts.",
        "keywords": "",
        "authors": [
            {
                "name": "Jennifer Pearson"
            },
            {
                "name": "Simon Robinson"
            },
            {
                "name": "Matt Jones"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw138": {
        "title": "Manifestation of depression and loneliness on social networks: A case study of young adults on Facebook",
        "abstract": "As people around the world are spending increasing amounts of time online, the question of how online experiences are linked to health and well-being is essential. This paper presents how online activities on Facebook are associated with the depressive states of users. Based on logs of 212 young adults, we show not only the sheer size of the network but also the frequency and diversity of interactions on social networks have close associations with depression. Depressed individuals reported smaller involved networks regarding comments and likes, the two popular forms of interactions. In contrast to the decreased level of interactions, depressed individuals showed an increase in the wall post rates and were active online during midday, which can be interpreted as an endemic behavior linked to the perceived degree of loneliness among young adults who are avid users of social media. We discuss these findings from theoretical, empirical, and subjective perspectives.",
        "keywords": "",
        "authors": [
            {
                "name": "Sungkyu Park"
            },
            {
                "name": "Sang Won Lee"
            },
            {
                "name": "Inyeop Kim"
            },
            {
                "name": "Meeyoung Cha"
            },
            {
                "name": "bumseok jeong"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw144": {
        "title": "A Classroom Study of Using Crowd Feedback in the Iterative Design Process",
        "abstract": "Crowd feedback systems offer an emerging approach for helping designers improve their designs, but there is little empirical evidence of the benefit of these systems. In this paper, we report the results of a study of using a crowd feedback system to iterate on visual designs. Users in an introductory visual design course created initial designs satisfying a design brief and received crowd feedback on the designs. Users revised the designs and the system was used to generate feedback again. This format enabled us to detect the changes between the initial and revised designs and how the feedback related to those changes. We further analyzed the value of crowd feedback by comparing it with expert evaluation and feedback generated via free-form prompts. Results showed that the crowd feedback system prompted deep and cosmetic changes and led to improved designs, the crowd recognized the design improvements, and structured workflows generated more interpretative, diverse, and critical feedback than free-form prompts.",
        "keywords": "",
        "authors": [
            {
                "name": "Anbang Xu"
            },
            {
                "name": "huaming rao"
            },
            {
                "name": "Brian P Bailey"
            },
            {
                "name": "Steven P Dow"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw145": {
        "title": "A Framework for Understanding and Designing Telepresence",
        "abstract": "As a field, telepresence has grown to include a wide range of systems, from multi-view videoconferencing units to humanlike androids. However, the diversity of systems and research makes it difficult to form a holistic understanding of where the field stands as a whole. We propose a framework consisting of seven design dimensions for understanding telepresence, iteratively developed from previous literature, a series of three surveys, the construction of two design probes, and a field study. In this work, we explain our development process, describe our design dimensions -- initiation, physical environment, mobility, vision, social environment, communication, and independence -- and demonstrate the use of our framework as a tool to (1) highlight opportunities for future work, (2) identify generalizable findings from research, and (3) facilitate communication in the telepresence community.",
        "keywords": "",
        "authors": [
            {
                "name": "Irene Rae"
            },
            {
                "name": "Gina Venolia"
            },
            {
                "name": "John C Tang"
            },
            {
                "name": "David Molnar"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw148": {
        "title": "The Effects of Crowdfunding on Entrepreneurial Self-Efficacy",
        "abstract": "Crowdfunding is emerging as a new socio-technical system that is changing how entrepreneurs interact with their community of financial supporters. While computer-supported cooperative work (CSCW) researchers have begun to explore how this new type of system influences entrepreneurial work, less is understood about how the system influences their psychological experience -- specifically self-efficacy, or belief in one's own ability to succeed at a task, which affects persistence, learning, and performance. Drawing on Bandura's Social Cognitive Theory, we conducted a qualitative study of 53 entrepreneurs using crowdfunding and found that crowdfunding can influence self-efficacy through (1) social validation, (2) role modeling, (3) mastery, and (4) physiological states supported by socio-technical features, such as displaying a concrete goal, examples of other's work, or public feedback. Results suggest how socio-technical systems can be designed to help entrepreneurs perform to enhance our economic and social prosperity.",
        "keywords": "",
        "authors": [
            {
                "name": "Emily K Harburg"
            },
            {
                "name": "Julie S Hui"
            },
            {
                "name": "Michael D Greenberg"
            },
            {
                "name": "Elizabeth M Gerber"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw151": {
        "title": "\"You Never Call, You Never Write\": Call and SMS Logs Do Not Always Indicate Tie Strength",
        "abstract": "How effective are call and SMS logs in modeling tie strength? Frequency and duration of communication has long been cited as a major aspect of tie strength. Intuitively, this makes sense: people communicate with those that they feel close to. Highly cited research papers have pushed this idea further, using communication as a direct proxy for tie strength. However, this operationalization has not been validated. Our work evaluates this assumption. We collected call and SMS logs and ground truth relationship data from 36 participants. Consistent with theory, we found that frequent or long-duration communication likely indicates a strong tie. However, the use of call and SMS logs produced many errors in separating strong and weak ties, suggesting this approach is incomplete. Follow-up interviews indicate fundamental challenges for inferring tie strength from communication logs. ",
        "keywords": "",
        "authors": [
            {
                "name": "Jason Wiese"
            },
            {
                "name": "Jun-Ki Min"
            },
            {
                "name": "Jason I Hong"
            },
            {
                "name": "John Zimmerman"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw155": {
        "title": "Crowds on Wall Street: Extracting Value from Collaborative Investing Platforms",
        "abstract": " In crowdsourced systems, it is often difficult to separate the highly capable \"experts\" from the average worker.  In this paper, we study the problem of evaluating and identifying experts in the context of SeekingAlpha and StockTwits, two crowdsourced investment services that are  encroaching on a space dominated for decades by large investment banks.  We seek to understand the quality and impact of content on collaborative investment platforms, by empirically analyzing complete datasets of SeekingAlpha articles (9 years) and StockTwits messages (4 years).  We develop sentiment analysis tools and correlate contributed content to the historical performance of relevant stocks. While SeekingAlpha articles and StockTwits messages provide minimal correlation to stock performance in aggregate, a subset of experts contribute more valuable (predictive) content.  We show that these authors can be easily identified by user interactions, and investments using their analysis significantly outperform broader markets. Finally, we conduct a user survey that sheds light on users views of SeekingAlpha content and stock manipulation.",
        "keywords": "",
        "authors": [
            {
                "name": "GANG WANG"
            },
            {
                "name": "Tianyi Wang"
            },
            {
                "name": "Bolun Wang"
            },
            {
                "name": "Divya Sambasivan"
            },
            {
                "name": "Zengbin Zhang"
            },
            {
                "name": "Haitao Zheng"
            },
            {
                "name": "Ben Y Zhao"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw161": {
        "title": "Paper-Digital Workflows in Global Development Organizations",
        "abstract": "Global development organizations rely on the essential affordances provided by both paper and digital materials to navigate hurdles posed by poor infrastructure, low connectivity, linguistic differences, and other socioeconomic constraints that render communication and collaboration challenging. This paper presents a study of the collaborative practices around paper-digital workflows within global development organizations operating in low-resource environments. We use a mixed methods approach to gather data from 23 organizations in 16 countries. Our findings show the tensions that arise between the ubiquitousness of paper and the desirability of digitized data, and highlight the challenges associated with transitioning information several times between paper and digital materials. We also reveal design opportunities for new tools to bridge the gap between paper-based and digital information in low-resource settings. Finally, we contribute a nuanced understanding of the cross-cultural and infrastructural challenges that influence the paper-digital lifecycle. Our findings will be useful for researchers and practitioners interested in understanding or participating in the workflows that drive global development.",
        "keywords": "",
        "authors": [
            {
                "name": "Nicola L Dell"
            },
            {
                "name": "Trevor Perrier"
            },
            {
                "name": "Neha Kumar"
            },
            {
                "name": "Mitchell Lee"
            },
            {
                "name": "Rachel Powers"
            },
            {
                "name": "Gaetano Borriello"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw164": {
        "title": "Forum77: An Analysis of an Online Health Forum Dedicated to Addiction Recovery",
        "abstract": "Prescription drug abuse is a pressing public health issue, and people who misuse prescription drugs are turning to online forums for help. Are such forums effective? We analyze the process of opioid withdrawal, recovery and relapse on Forum77, MedHelp.org's online health forum for substance abuse recovery. Applying Prochashka's Transtheoretic Model for behavior change, we develop a taxonomy describing phases of addiction expressed by Forum77 members. We examine activity and linguistic features across the phases USING, WITHDRAWING and RECOVERING. We train statistical classifiers to identify addiction phase, relapse and whether a user was RECOVERING at the time of her last post. Applying our classifiers to more than 2,848 users, we find that while almost 50% relapse, the prognosis for RECOVERING is favorable. Supplementing our results with users' own accounts of their experiences, we discuss Forum77's efficacy and shortcomings, as well as implications for future technologies.",
        "keywords": "",
        "authors": [
            {
                "name": "Diana L MacLean"
            },
            {
                "name": "Sonal Gupta"
            },
            {
                "name": "Anna Lembke"
            },
            {
                "name": "Christopher D Manning"
            },
            {
                "name": "Jeffrey Heer"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw166": {
        "title": "Strangers at the Gate: Gaining Access, Building Rapport, and Co-Constructing Community-Based Research",
        "abstract": "This paper is about the work we do to create productive partnerships in community settings: developing relationships, demonstrating commitments, and overcoming personal and institutional barriers to community-based design research. Through an ethnographic account of the elements of community-based research normally elided from reports of design process, we explore how the impact of institutional histories and personal relationships went beyond simply identifying potential partners, but fundamentally guided the research questions and approach. We examine the different roles researchers play -- researcher, confidant, advocate, interloper, invader, and collaborator -- and how those roles create particular relations in the field. The contribution of this work is the development of a reflective account of the research in order to evaluate knowledge production, rigor, and advance methods for engaging in community-based research. ",
        "keywords": "",
        "authors": [
            {
                "name": "Christopher A Le Dantec"
            },
            {
                "name": "Sarah Fox"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 1,
        "bestPaperNominee": 0
    },
    "cscw171": {
        "title": "Increasing the Reach of Snowball Sampling: The Impact of Fixed versus Lottery Incentives",
        "abstract": "Though many researchers have studied how to incentivize people to respond to surveys, little is known about how these incentives impact respondents' willingness to recruit their peers to participate as well. In this paper, we show that the incentives offered for individual survey responses can have a dramatic impact on the overall reach of a survey through a network of peers. In a field experiment in India, we made a survey accessible via mobile phones and offered respondents either a fixed incentive (guaranteed payment of about $0.17) or a lottery incentive (1% chance of winning $17). When asked to choose, a significant fraction of respondents preferred the lottery incentive. However, when encouraged to spread the survey, the fixed incentive spread over 100 times further, reaching about 800 people in a day. We interpret this surprising result and discuss the implications for HCI.",
        "keywords": "",
        "authors": [
            {
                "name": "Aditya Vashistha"
            },
            {
                "name": "Edward Cutrell"
            },
            {
                "name": "William Thies"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw174": {
        "title": "The Modern Day Baby Book: Enacting Good Mothering and Stewarding Privacy on Facebook",
        "abstract": "The practice of sharing family photographs is as old as the camera itself. Many mothers now share baby photos online, yet little is known about what kinds of baby photos they share and their motivations for doing so. Drawing on semi-structured interviews with 22 new mothers, we find that they share cute, funny, milestone, and family and friend photos but refrain from sharing crying and naked photos. While some mothers harbor concerns about controlling information, oversharing, and digital footprints, the benefits of receiving validation outweighs their concerns. Sharing baby photos on Facebook helps new mothers enact \"good mothering\" by performing their identities as mothers then receiving validation of those identities. However, mothers are charged with the responsibility of stewarding their children's privacy and identities online. As a result, mothers must exchange benefits of sharing baby photos with risks of creating digital footprints for their child.",
        "keywords": "",
        "authors": [
            {
                "name": "Priya Kumar"
            },
            {
                "name": "Sarita Schoenebeck"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw179": {
        "title": "They Said What? Exploring the Relationship Between Language Use and Member Satisfaction in Communities",
        "abstract": "In online communities, satisfied members are essential to community success, since they are more likely to contribute and consume content, engage with other members, and feel committed to the community. However, it is difficult for community leaders to know, on an on-going basis, whether members are satisfied. In this paper, we explore the relationship between member satisfaction and language use within content posted in workplace online communities. We hope to find patterns of language use that are associated with satisfied members. We employ linguistic analysis based on LIWC, and a survey to directly measure member satisfaction in 142 workplace communities. We contribute a better understanding of how members interact in effective workplace communities, and show that linguistic analysis could be a useful part of future methods to automatically assess community member satisfaction.",
        "keywords": "",
        "authors": [
            {
                "name": "Tara L Matthews"
            },
            {
                "name": "Jalal U Mahmud"
            },
            {
                "name": "Jilin Chen"
            },
            {
                "name": "Michael Muller"
            },
            {
                "name": "Eben Haber"
            },
            {
                "name": "Hernan Badenes"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw181": {
        "title": "Studying and Modeling the Connection between People's Preferences and Content Sharing",
        "abstract": "People regularly share items using online social media. However, people's decisions around sharing -- who shares what to whom and why -- is not well understood. We present a user study involving 87 pairs of Facebook users to understand how people make their sharing decisions. We find that even when sharing to a specific individual, people's own preference for an item (individuation) dominates over the recipient's preferences (altruism). People's open-ended responses about how they share, however, indicate that they do try to personalize shares based on the recipient. To explain these contrasting results, we propose a novel process model of sharing that takes into account people's preferences and the salience of an item.  We also present encouraging results for a sharing prediction model that incorporates both the senders' and the recipients' preferences. These results suggest improvements to both algorithms that support sharing in social media and to information diffusion models.",
        "keywords": "",
        "authors": [
            {
                "name": "Amit Sharma"
            },
            {
                "name": "Dan Cosley"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw188": {
        "title": "Disclosure, Stress, and Support During Gender Transition on Facebook",
        "abstract": "Sociotechnical systems, such as social networking sites (SNS), often privilege people who fit within expected, static categories. Thus, users embarking on major identity changes, such as gender transition, often encounter stress when using SNSs to interact with their online social networks. To address this problem and reflect on the design of SNSs and other sociotechnical systems, we present the results of a comprehensive online survey of transgender and gender non-conforming SNS users. Our findings indicate that although Facebook can be a stressful place for gender transition due to difficulties of transition disclosure, support from one's Facebook network can help to mitigate some of this stress. We examine Facebook both as a site of stress and as a site of support. Better understanding the relationships between stress, disclosure, and support on SNSs for these particular users can inform technology design that will benefit people who struggle with navigating a wide range of major identity changes online.",
        "keywords": "",
        "authors": [
            {
                "name": "Oliver L Haimson"
            },
            {
                "name": "Jed R Brubaker"
            },
            {
                "name": "Lynn S Dombrowski"
            },
            {
                "name": "Gillian R Hayes"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw191": {
        "title": "(Infra)structures of Volunteering",
        "abstract": "We report on the results of a diary study of the everyday volunteering and help giving of individuals in the millennial generation. We describe the breadth of work structures implicated in volunteering, the social structures implicated in volunteering, and unpack the interdependencies between the two. We analyze the roles that technology plays in volunteering with a particular focus on the forms of infrastructure that are constituted through the work and social structures of this philanthropic activity. Finally, we reflect on design opportunities for infrastructures where work and social structures meet to support more everyday, ubiquitous forms of volunteering.",
        "keywords": "",
        "authors": [
            {
                "name": "Amy Voida"
            },
            {
                "name": "Zheng Yao"
            },
            {
                "name": "Matthias Korn"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw193": {
        "title": "Models and Patterns of Trust",
        "abstract": "As in all collaborative work, trust is a vital ingredient of successful computer supported cooperative work, yet there is little in the way of design principles to help practitioners develop systems that foster trust. To address this gap, we present a set of design patterns, based on our experience designing systems with the explicit intention of increasing trust between stakeholders. We contextualize these patterns by describing our own learning process, from the development, testing and refinement of a trust model, to our realization that the insights we gained along the way were most usefully expressed through design patterns. In addition to a set of patterns for trust, this paper seeks to demonstrate of the value of patterns as a means of communicating the nuances revealed through ethnographic investigation.",
        "keywords": "",
        "authors": [
            {
                "name": "Bran Knowles"
            },
            {
                "name": "Mark Rouncefield"
            },
            {
                "name": "Mike Harding"
            },
            {
                "name": "Nigel Davies"
            },
            {
                "name": "Lynne Blair"
            },
            {
                "name": "James Hannon"
            },
            {
                "name": "John Walden"
            },
            {
                "name": "Ding Wang"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw202": {
        "title": "Is It Good to Be Like Wikipedia?: Exploring the Trade-offs of Introducing Collaborative Editing Model to Q&A Sites",
        "abstract": "Online question and answer (Q&A) sites, which are platforms for users to post and answer questions on a wide range of topics, are becoming large repositories of valuable knowledge and important to societies. In order to sustain success, Q&A sites face the challenges of ensuring content quality and encouraging user contributions. This paper examines a particular design decision in Q&A sites -- allowing Wikipedia-like collaborative editing on questions and answers, and explores its beneficial effects on content quality and potential detrimental effects on users' contributions. By examining five years' archival data of Stack Overflow, we found that the benefits of collaborative editing outweigh its risks. For example, each substantive edit from other users can increase the number of positive votes by 181% for the questions and 119% for the answers. On the other hand, each edit only decreases askers and answerers' subsequent contributions by no more than 5%. This work has implications for understanding and designing large-scale social computing systems.",
        "keywords": "",
        "authors": [
            {
                "name": "Guo Li"
            },
            {
                "name": "Haiyi Zhu"
            },
            {
                "name": "Tun Lu"
            },
            {
                "name": "Xianghua Ding"
            },
            {
                "name": "Ning Gu"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw209": {
        "title": "Illegitimate Civic Participation: Supporting ICT Use on the Ground",
        "abstract": "In this paper we examine the way Information and Communications Technologies (ICTs) support forms of community activism that operate outside formal political and institutional channels. By working with activists concerned with issues of housing justice, we are able gain insight into the way ICTs play a role in complementing forms of civic engagement that challenges, rather than works with, institutional authority. We argue that ICTs are instrumental in supporting and shaping three alternate information practices -- situating, codification, and scaffolding -- that each serve the goals of direct democratic engagement. We also show how local activist communities engage in these three practices through their varied use of ICTs, including the ways they provide mechanisms for informal but politically significant -- and legitimate -- civic engagement.",
        "keywords": "",
        "authors": [
            {
                "name": "Mariam Asad"
            },
            {
                "name": "Christopher A Le Dantec"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw212": {
        "title": "Making Time",
        "abstract": "'This paper draws together research by and arguments put forwards by others to examine claims about time and technology, and in particular, the notion that technology is implicated in the speeding up of the everyday. We consider research that shows how the introduction of the clock was preceded by sociocultural shifts in ways of thinking about time, before considering whether a similar argument can be made for digital technologies. We suggest that digital technologies are generally well suited to current sociotemporal patterns, an observation that suggests that 'redesigning' the experience of temporality as mediated by technologies necessitates a broader way of dealing with the routines and rhythms of everyday life. We then consider how different temporal patterns and orders intersect, in light of recent proposals to consider time as collective. We conclude with some suggestions as to what this could mean for CSCW.",
        "keywords": "",
        "authors": [
            {
                "name": "Siân E Lindley"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw213": {
        "title": "Accessible Crowdwork? Understanding the Value in and Challenge of Microtask Employment for People with Disabilities",
        "abstract": "We present the first formal study of crowdworkers who have disabilities via in-depth open-ended interviews of 17 people (disabled crowdworkers and job coaches for people with disabilities) and a survey of 631 adults with disabilities. Our findings establish that people with a variety of disabilities currently participate in the crowd labor marketplace, despite challenges such as crowdsourcing workflow designs that inadvertently prohibit participation by, and may negatively affect the worker reputations of, people with disabilities. Despite such challenges, we find that crowdwork potentially offers different opportunities for people with disabilities relative to the normative office environment, such as job flexibility and lack of a need to rely on public transit. We close by identifying several ways in which crowd labor platform operators and/or individual task requestors could improve the accessibility of this increasingly important form of employment.",
        "keywords": "",
        "authors": [
            {
                "name": "Kathryn Zyskowski"
            },
            {
                "name": "Meredith R Morris"
            },
            {
                "name": "Jeffrey P Bigham"
            },
            {
                "name": "Mary L Gray"
            },
            {
                "name": "Shaun Kane"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw215": {
        "title": "Spaceship Launch: Designing an Exergame for Families",
        "abstract": "Parents play a critical role in facilitating children's physical activity, as they are an important source of modeling and support. While Human-Computer Interaction (HCI) researchers have explored exergame design for children or adults separately, an important open area of work is identifying design guidelines for family exergames. One question that researchers have increasingly posed is, how can exergames be designed to avoid potential negative consequences of competition? To address these questions we designed Spaceship Launch, an exergame for parents and kids in lower income neighborhoods, where obesity is most prevalent. We describe our iterative design process: the formative study to identify design opportunities, our resulting system, and our field evaluation of the tool. Our findings highlight the impact of SL on physical activity intentions, and how parental preferences for in-game competition were aligned with the psychological needs of relatedness and competence. We conclude with design recommendations for future family-focused exergames.",
        "keywords": "",
        "authors": [
            {
                "name": "Herman Saksono"
            },
            {
                "name": "Ashwini Ranade"
            },
            {
                "name": "Geeta Kamarthi"
            },
            {
                "name": "Carmen Castaneda-Sceppa"
            },
            {
                "name": "Jessica A Hoffman"
            },
            {
                "name": "Cathy Wirth"
            },
            {
                "name": "Andrea G Parker"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw217": {
        "title": "The Editor's Eye: Curation and Comment Relevance on the New York Times",
        "abstract": "The journalistic curation of social media content from platforms like Facebook and YouTube or from commenting systems is underscored by an imperative for publishing accurate and quality content. In this work we study the manifestation of editorial quality criteria in comments that have been curated and selected on the New York Times website as \"NYT Picks.\" In particular we examine the relationship between comment selection and comment relevance through the analysis of 331,785 comments, including 12,542 editor's selections. We find a robust association between editorial selection and article relevance as well as conversational relevance. Our results are discussed in terms of their implications for reducing journalistic curatorial work load, or scaling the ability to examine more comments for editorial selection, as well as how end-user commenting experiences might be improved. ",
        "keywords": "",
        "authors": [
            {
                "name": "Nicholas A Diakopoulos"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw218": {
        "title": "From The Matrix to a Model of Coordinated Action (MoCA): A Conceptual Framework of and for CSCW",
        "abstract": "The CSCW community is reliant upon technology-centric models of groupware and collaboration that frame how we examine and design for cooperative work. This paper both reviews the CSCW literature to examine existing models of collaborative work and proposes a new, expanded conceptual model: the Model of Coordinated Action (MoCA). MoCA is a broader framework for describing complex collaborative situations and environments including, but not limited to, collaborations that have diverse, high-turnover memberships or emerging practices. We introduce MoCA's seven dimensions of coordinative action and illustrate their connection to past and current CSCW research. Finally, we discuss some ramifications of MoCA for our understanding of CSCW as a sociotechnical design space.",
        "keywords": "",
        "authors": [
            {
                "name": "Charlotte P Lee"
            },
            {
                "name": "Drew Paine"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw225": {
        "title": "Designing for Discomfort: Supporting Critical Reflection through Interactive Tools",
        "abstract": "A focus of human-computer interaction work and a central principle of user experience is that design should avoid discomfort and aim to craft positive experiences for individuals. However, for contexts in which an uncomfortable reaction is intended, instrumental, or indeed inevitable, we recognize that it is inappropriate to design for a positive or \"feel good\" experience. Herein we describe an investigation into the use of interactive technologies to support transformative learning, a process through which individuals engage with feelings of discomfort. The project is grounded by work with graduate students enrolled in a course that employed decolonizing pedagogies. Throughout the course students responded to uncomfortable, problematic scenarios through interactive tools.   We present our analysis of students' learning experiences, their interactions with technologies and their reflections on the effectiveness of these engagements in terms of supporting opportunities for critical reflection, a crucial stage of the transformative learning process. ",
        "keywords": "",
        "authors": [
            {
                "name": "Helen Halbert"
            },
            {
                "name": "Lisa P Nathan"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw231": {
        "title": "Content and Network Dynamics Behind Egyptian Political Polarization on Twitter",
        "abstract": "At this point, there is little question about whether social networks play a role in modern protests. This agreement has triggered an entire research avenue, in which social structure and content analysis have been central -- but exploited separately.  Here, we combine these two approaches to shed light on the opinion evolution dynamics in Egypt during the summer of 2013 along two axis (Islamist/Secularist, pro/anti-military intervention). We intend to find traces of opinion changes in Egypt's population, paralleling those in the international community -- which oscillated from sympathetic to condemnatory as civil clashes grew. We find little evidence of people \"switching\" sides, along with clear changes in volume in both pro- and anti-military camps. Our work contributes new insights into the dynamics of large protest movements, specially in the aftermath of the main events -- rather unattended previously. It questions the standard narrative concerning a simplistic mapping between Secularist/pro-military and Islamist/anti-military. Finally, our conclusions provide empirical validation to sociological models regarding the behavior of individuals in conflictive contexts.",
        "keywords": "",
        "authors": [
            {
                "name": "Javier Borge-Holthoefer"
            },
            {
                "name": "Walid Magdy"
            },
            {
                "name": "Kareem Darwish"
            },
            {
                "name": "Ingmar Weber"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw233": {
        "title": "Collaborative Affordances of Hybrid Patient Record Technologies in Medical Work",
        "abstract": "The medical record is a central artifact used to organize, communicate and coordinate information related to patient care. Despite recent deployments of electronic health records (EHR), paper medical records (PMR) are still widely used because of the affordances of paper to achieve overview, intermittent documentation, and collaboration. Although a number of technologies explored the integration of paper and digital technology, very few studies investigate the affordances of novel technologies in relation to those of the PMR. This paper studies the use of one such novel technology, called Hybrid Patient Record, designed to digitally augment a paper medical record. We report on a controlled medical simulation in which the HyPR was used by 8 clinicians. The objective was to investigate and frame the collaborative affordances of this hybrid technology to the existing knowledge on paper medical records. The study shows that most of the collaborative affordances of the PMR were for a large degree transferred to the hybrid technology, while others were even amplified.",
        "keywords": "",
        "authors": [
            {
                "name": "Steven Houben"
            },
            {
                "name": "Jakob E Bardram"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw235": {
        "title": "Capture the Moment: \"In the Wild\" Longitudinal Case Study of Situated Snapshots Captured Through an Urban Screen in a Community Setting",
        "abstract": "Urban screens are becoming a common element of our city landscape. As such they offer new ways of connecting people that occupy public space, e.g., by taking situated snapshots through a display-attached camera. In this paper we present a first longitudinal case study of 12 weeks of such an application -- Moment Machine -- deployed \"in the wild\" on an urban screen facing the street. We report findings from 1189 photos taken, 13 interviews, and 3 weeks of observations that show engagement stimulated by situated snapshots within a place-based community where the screen is located. We also analyze interaction log files to describe how often users interacted, what type of interactions they had and how long they lasted, and overall engagement on a weekly basis and throughout the week. Based on our experience, we provide three take-away snippets for designers of similar urban screen experiences.",
        "keywords": "",
        "authors": [
            {
                "name": "Nemanja Memarovic"
            },
            {
                "name": "Ava Fatah gen Schieck"
            },
            {
                "name": "Holger M Schnädelbach"
            },
            {
                "name": "Efstathia Kostopoulou"
            },
            {
                "name": "Steve North"
            },
            {
                "name": "Lei Ye"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw237": {
        "title": "Making distance matter  with small groups in massive classes",
        "abstract": "Massive online classes are global and diverse. (How) can we harness this diversity to improve engagement and learning? Currently, though enrollments are high, students' interactions with each other are minimal: most are alone together. This isolation is particularly disappointing given that a global community is a major draw of online classes. This paper illustrates the potential of leveraging geographic diversity of massive online classes. It introduces a peer discussion system called Talkabout that connects students through small-group video discussions to peers from around the world. To date, over 3,400 students in eight massive classes have used Talkabout. Three studies with 2,670 students from two classes found that globally diverse discussions boost student performance and engagement: the more geographically diverse the discussion group, the better the students performed on later quizzes. Through this work, we challenge the view that online classes are useful only when in-person classes are unavailable. Instead, we demonstrate how diverse online classrooms can create benefits that are largely unavailable in traditional classrooms. ",
        "keywords": "",
        "authors": [
            {
                "name": "Chinmay E Kulkarni"
            },
            {
                "name": "Julia Cambre"
            },
            {
                "name": "Yasmine Kotturi"
            },
            {
                "name": "Michael S Bernstein"
            },
            {
                "name": "Scott R Klemmer"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw248": {
        "title": "Expertise in the Wired Wild West",
        "abstract": "This ethnographic study reveals how expertise was sought, articulated and actuated across online and offline worlds to enable the evacuation of 38 horses from an isolated ranch in the mountainous region of Northern Colorado following a series of devastating flash floods in September 2013. The shared expertise within a loosely connected community of practice bridged spatial-temporal limitations and afforded opportunities for practical assistance and response, both virtually and on the ground. Interaction via social media articulated the parameters of the emergent problem to be solved, and \"cast a net\" to find the expertise necessary to address different aspects of the perceived problem. Eventually, more than 60 people with equine expertise converged onto the ranch, bringing their materials to execute a single-day evacuation and relocation of the herd. ",
        "keywords": "",
        "authors": [
            {
                "name": "Joanne I White"
            },
            {
                "name": "Leysia Palen"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw252": {
        "title": "Shared Calendars for Home Health Management",
        "abstract": "What is the role of shared calendars for home health management? Utilizing a maximum variation sampling method, we interviewed 20 adult individuals with diabetes and 20 mothers of children with asthma to understand calendar use in the context of chronic disease home health management. In comparing the experiences of these two groups, we explore participants' use of tools for organizing tasks and appointments, their strategies for capturing health and non-health events in the family calendar system, the ecology of artifacts that intersect with their scheduling tools, and the failures they experienced while managing their calendar systems. Through this work, we offer a context-specific perspective of schedule management strategies for individuals and families who must integrate their handling of chronic illnesses with everyday living. ",
        "keywords": "",
        "authors": [
            {
                "name": "Jordan Eschler"
            },
            {
                "name": "Logan Kendall"
            },
            {
                "name": "Kathleen O'Leary"
            },
            {
                "name": "Lisa M Vizer"
            },
            {
                "name": "Paula Lozano"
            },
            {
                "name": "Jennifer B McClure"
            },
            {
                "name": "Wanda Pratt"
            },
            {
                "name": "James D Ralston"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw257": {
        "title": "Back in Sight, Back in Mind: Picture-Centric Support for Mobile Counseling Sessions",
        "abstract": "This paper explores unique challenges of mobile consultancy and offers a picture-centric solution. We study the example of a policeman counseling a home-owner on how to prevent burglary. As in a stationary set-up, consultants and clients collaborate to co-create solutions to match the clients' problems. Concurrently, in a mobile set-up, problem and solution information are bound to the physical environment of the house. Moving through the house, both clients and consultants forget crucial location-bound information, severely impairing their collaboration. We propose supporting such collaboration with a tablet-based application that is centered on pictures of the physical environment, called SmartProtector. In an evaluation, we show that both clients and consultants remember substantially more information when using the SmartProtecor. With this study, we contribute to the ongoing research discussion on collaborative memory, memory aid systems and mobile collaboration, highlighting the roles of pictures and their large potential to enhance collaborative work practices.",
        "keywords": "",
        "authors": [
            {
                "name": "Tobias Giesbrecht"
            },
            {
                "name": "Tino Comes"
            },
            {
                "name": "Gerhard Schwabe"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw259": {
        "title": "Mood Squeezer: Lightening up the Workplace through Playful and Lightweight Interactions",
        "abstract": "Many companies would like to redesign their workspaces to make them more pleasant and even fun places to work in. An assumption is it will result in social and economic benefits. However, it can be difficult to achieve because of cost, level of disruption and regulations. We present an alternative approach that provides an injection of playfulness into 'drab' office buildings. A lightweight technology intervention was designed - Mood Squeezer - that asks people to reflect on their mood by squeezing a colored ball from a box set. The squeezes are mirrored back as an aggregate colorful visualization on a public floor display. An in-the-wild study showed how this intervention was successful at getting people to squeeze their mood, leading to a diversity of conversations throughout the building. We discuss how this lightweight approach to office augmentation can provide new opportunities for opening up a 'closed' workplace.",
        "keywords": "",
        "authors": [
            {
                "name": "Sarah Gallacher"
            },
            {
                "name": "Jenny O'Connor"
            },
            {
                "name": "Jon Bird"
            },
            {
                "name": "Yvonne Rogers"
            },
            {
                "name": "Licia Capra"
            },
            {
                "name": "Daniel Harrison"
            },
            {
                "name": "Paul Marshall"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw262": {
        "title": "Designing Mobile Experiences for Collocated Interaction",
        "abstract": "Many of our everyday social interactions involve mobile devices. Yet, these tend to only provide good support for distributed social interactions. Although much HCI and CSCW research has explored how we might support collocated, face-to-face situations using mobile devices, much of this work exists as isolated exemplars of technical systems and / or interaction designs. This paper draws on a range of such exemplars to develop a practical design framework intended for guiding the design of new mobile experiences for collocated interaction as well as analysing existing ones. Our framework provides four relational perspectives for designing the complex interplay between: the social situation in which it takes place; the technology used and the mechanics inscribed; the physical environment; and the temporal elements of design. Moreover, each perspective is features some core properties, which are highly relevant when designing these systems. As part of presenting the framework we also explain the process of its construction along with practical advice on how to read and apply it.",
        "keywords": "",
        "authors": [
            {
                "name": "Sus Lundgren"
            },
            {
                "name": "Joel E Fischer"
            },
            {
                "name": "Stuart Reeves"
            },
            {
                "name": "Olof Torgersson"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw267": {
        "title": "From Personal Tool to Community Resource:  What's the Extra Work and Who Will Do It?",
        "abstract": "Sharing scientific data, software, and instruments is becoming increasingly common as science moves toward large-scale, distributed collaborations. Sharing these resources requires extra work to make them generally useful. Although we know much about the extra work associated with sharing data, we know little about the work associated with sharing contributions to software, even though software is of vital importance to nearly every scientific result. This paper presents a qualitative, interview-based study of the extra work that developers and end users of scientific software undertake. Our findings indicate that they conduct a rich set of extra work around community management, code maintenance, education and training, developer-user interaction, and foreseeing user needs. We identify several conditions under which they are likely to do this work, as well as design principles that can facilitate it. Our results have important implications for future empirical studies as well as funding policy.",
        "keywords": "",
        "authors": [
            {
                "name": "Erik H Trainer"
            },
            {
                "name": "Chalalai Chaihirunkarn"
            },
            {
                "name": "Arun Kalyanasundaram"
            },
            {
                "name": "Jim Herbsleb"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw269": {
        "title": "Emotion Map: A Location-based Mobile Social System for Improving Emotion Awareness and Regulation",
        "abstract": "Effective emotion regulation can benefit many aspects of our lives such as mental health and work performance. Informed by emotion regulation theories and in consultation with our university counseling center, we designed a novel location-based mobile social app, Emotion Map, to help improve people's awareness and regulations of their emotions. The app allows users to log their emotions with the associated time, location, and activity information. Users can keep these logged emotions to themselves or share them with others publicly or anonymously. We conducted a 4-week field trial of the app with 14 university students. Combining usage logs and in-person interviews, our analysis shows promising results of the app.  Specifically, we found that the app improved some participants' self-knowledge of their emotions, supported their various emotion regulations, and enabled better awareness of the emotion statuses of their friends and communities.",
        "keywords": "",
        "authors": [
            {
                "name": "Yun Huang"
            },
            {
                "name": "Ying Tang"
            },
            {
                "name": "Yang Wang"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw271": {
        "title": "Exiting the Design Studio: Leveraging Online Participants for Early-Stage Design Feedback",
        "abstract": "Online collaboration tools enable developers of interactive systems to quickly reach potential users for usability test-ing. Can these technologies serve designers who seek feedback on user needs during the earliest stages of design? Online needfinding may help designers create products and services that can target a more diverse user population. To explore this, we conducted a feasibility study to compare face-to-face methods with online needfinding sessions. We found that video can sufficiently capture nuanced reactions to preliminary concept storyboards, but that feedback providers need guidance and structure. We then introduce a tool for collecting early-stage design feedback from online participants and conduct a case study with a professional design team. The team conducted needfinding activities with local participants, as well as a cost-equivalent number of online participants The case study demonstrates that combining online crowdsourcing with a video survey tool provides a simple and cost-efficient way to collect early-stage feedback.",
        "keywords": "",
        "authors": [
            {
                "name": "Xiaojuan Ma"
            },
            {
                "name": "Li Yu"
            },
            {
                "name": "Steven P Dow"
            },
            {
                "name": "Jodi L Forlizzi"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw272": {
        "title": "\"This is a Throwaway Account\":  Temporary Technical Identities and Perceptions of Anonymity in a Massive Online Community",
        "abstract": "This paper explores temporary identities on social media platforms and individuals' uses of these identities with respect to their perceptions of anonymity. Given the research on multiple profile maintenance, little research has examined the role that some social media platforms play in affording users with temporary identities. Further, most of the research on anonymity stops short of the concept of varying perceptions of anonymity. This paper builds on these research areas by describing the phenomenon of temporary \"throwaway accounts\" and their uses on reddit.com, a popular social news site. In addition to ethnographic trace analysis to examine the contexts in which throwaway accounts are adopted, this paper presents a predictive model that suggests that perceptions of anonymity significantly shape the potential uses of throwaway accounts and that female users are much more likely to adopt temporary identities than male users.",
        "keywords": "",
        "authors": [
            {
                "name": "Alex Leavitt"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw278": {
        "title": "Handheld or Handsfree? Remote Collaboration via Lightweight Head-Mounted Displays and Handheld Devices",
        "abstract": "Emerging wearable and mobile communication technologies, such as lightweight head-mounted displays (HMDs) and hand-held devices, promise support for everyday remote collaboration. Despite their potential for widespread use, their effectiveness as collaborative tools is unknown, particularly in physical tasks involving mobility. To better understand their impact on collaborative behaviors, perceptions, and performance, we conducted a two-by-two (technology type: HMD vs. tablet computer; task setting: static vs. dynamic) between-subjects study where \"helper\" and \"worker\" pairs (n=66) remotely collaborated in the construction of a physical object. Our results showed that, in the dynamic task, HMD use enabled helpers to offer more frequent directing commands and more proactive assistance, resulting in marginally faster task completion. In the static task, while tablet use helped convey subtle visual information, helpers and workers had conflicting perceptions of how the two technologies contributed to their success. Our findings offer strong design and research implications, underlining the importance of a consistent view of the shared workspace and the differential support collaborators receive from technologies.",
        "keywords": "",
        "authors": [
            {
                "name": "Steven J Johnson"
            },
            {
                "name": "Madeleine C Gibson"
            },
            {
                "name": "Bilge D Mutlu"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw281": {
        "title": "Supporting Developers' Coordination in The IDE",
        "abstract": "Teamwork in software engineering is time-consuming and problematic. In this paper, we explore how to better support developers' collaboration in teamwork, focusing on the software implementation phase happening in the integrated development environment (IDE), where developers spend most of their time. Conducting a qualitative investigation, we learn that developers' teamwork needs mostly regard coordination, rather than concurrent work on the same (sub)task, and that developers have problems dealing with breaking changes made by peers on the same project, but they successfully deal with other scenarios considered problematic in literature. We derive implications and recommendations.  Based on one of these recommendations we analyze the current IDE support for receiving code changes, finding that historical information is neither visible nor easily accessible. Consequently, we devise and qualitatively evaluate Bellevue, the design of an IDE extension that makes received changes always visible and code history accessible in the editor.",
        "keywords": "",
        "authors": [
            {
                "name": "Anja Guzzi"
            },
            {
                "name": "Alberto Bacchelli"
            },
            {
                "name": "Yann F Riche"
            },
            {
                "name": "Arie van Deursen"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 1,
        "bestPaperNominee": 0
    },
    "cscw284": {
        "title": "Piloting TrACE: Exploring Spatiotemporal Anchored Collaboration in Asynchronous Learning",
        "abstract": "The use of multimedia content such as video is becoming more prevalent in educational environments.  However, current platforms for hosting these media provide few collaborative tools to foster social learning between students or request help from instructors.  In this paper, we explore the potential of spatiotemporal anchored collaboration, and we present a prototype media-playback environment called TrACE that exemplifies the approach.  We examine a first design-based research (DBR) pilot deployment of TrACE in two post-secondary courses.  Results indicate that students do take advantage of the system's affordances to interact in meaningful ways, though overall student annotation authoring was limited. Using the pilot data, we propose socio-technical modifications for the next iteration in the DBR cycle. Specifically we focus on tools to support instructors' use of the system and for promoting collaboration between students.",
        "keywords": "",
        "authors": [
            {
                "name": "Brian Dorn"
            },
            {
                "name": "Larissa Schroeder"
            },
            {
                "name": "Adam Stankiewicz"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw285": {
        "title": "Do Birds of a Feather Watch Each Other? Homophily and Social Surveillance in Location Based Social Networks",
        "abstract": "Location sharing applications (LSA) have proliferated in recent years. Current research principally focuses on egocentric privacy issues and design but has historically not explored the impact of surveillance on location sharing behavior. In this paper, we examine homophily in friendship and surveillance networks for 65 foursquare users. Our results indicate that location surveillance networks are strongly homophilous along the lines of race and gender while friendship networks are weakly homophilous on income. Qualitatively, an analysis of comments and interviews provides support for a discourse around location surveillance, which is mainly social, collaborative, positive and participatory. We relate these findings with prior literature on surveillance, self-presentation and homophily and situate this study in existing HCI/CSCW scholarship.",
        "keywords": "",
        "authors": [
            {
                "name": "Shion Guha"
            },
            {
                "name": "Stephen Wicker"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw291": {
        "title": "Snack Buddy: Supporting Healthy Snacking in Low Socioeconomic Status Families",
        "abstract": "We conducted a 12-week comparative field trial with 20 low socioeconomic status (SES) caregivers from 10 families to explore their use of a sociotechnical mobile application designed to promote healthy snacking, Snack Buddy. Our analysis of the semi-structured interviews, pre/post-intervention instruments, and photo-elicitation interviews suggests that participants gained a greater awareness of their own snacking practices and those of their family members. Users were empowered to adjust their own practices and   beliefs around healthy eating because they were more aware of their family's snacking behaviors. We describe the unique social dynamics of how families engaged with each other and the application, which   includes positive social support for healthy eating. By providing insights into family interactions and experiences with the application, we identify benefits, challenges, and strategies when designing family-level sociotechnical interventions for healthy behavior.",
        "keywords": "",
        "authors": [
            {
                "name": "Christopher L Schaefbauer"
            },
            {
                "name": "Danish U Khan"
            },
            {
                "name": "Garrett Sczechowski"
            },
            {
                "name": "Amy Le"
            },
            {
                "name": "Katie A Siek"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw293": {
        "title": "MoodBar: Increasing new user retention in Wikipedia through lightweight socialization",
        "abstract": "Socialization in online communities allows existing members to welcome and recruit newcomers, introduce them to community norms and practices, and sustain their early participation. However, socializing newcomers does not come for free: in large communities, socialization can result in a significant workload for mentors and is hard to scale. In this study we present results from a natural experiment that measured the effect of a lightweight socialization tool on the activity and retention of newly registered users attempting to edit for the first time Wikipedia. Wikipedia is struggling with the retention of newcomers and our results indicate that a mechanism to elicit lightweight feedback and to provide early mentoring to newcomers improves their chances to become long-term contributors. ",
        "keywords": "",
        "authors": [
            {
                "name": "Giovanni Luca Ciampaglia"
            },
            {
                "name": "Dario Taraborelli"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw294": {
        "title": "Engaging Around Neighborhood Issues: How Online Communication Affects Offline Behaviors",
        "abstract": "In this paper, we describe how online communication about local crime affects offline behavior amongst local residents. We conducted a three-year study in five middle to low-income neighborhoods, where we observed community meetings for two years, interviewed 45 residents, and performed qualitative content analysis on over 7,000 online messages on community-based email lists and web forums. We found that community-based online communication influenced how residents 1) protect themselves and their property to avoid victimization and 2) participate and engage in local in-person civic engagement initiatives. Our contributions include in- sight into the relationship between online and offline behavior and implications for designing community-based ICTs that effectively address social topics.",
        "keywords": "",
        "authors": [
            {
                "name": "Sheena L Erete"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw295": {
        "title": "(Re)defining Land Change Science through Synthetic Research Practices",
        "abstract": "This paper investigates the co-evolution of scientific practice and supporting technologies for the interdisciplinary research community Land Change Science (LCS). Through nearly three years of iterative fieldwork and system design, we have developed a deep understanding of the role and processes of synthetic research practices, specifically the meta-study, for this community. This paper details how research synthesis acts as a way to move the community forward and the challenges that LCS researchers face in the process. We illustrate how our understanding of research synthesis is being used to inform the design and refinement of cyberinfrastructure to support this scientific practice.",
        "keywords": "",
        "authors": [
            {
                "name": "Alyson L Young"
            },
            {
                "name": "Wayne G Lutters"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw296": {
        "title": "Enhancing Evaluation of Potential Dates Online Through Paired Collaborative Activities",
        "abstract": "Online dating systems are the most common way people meet their marriage partners online. Nevertheless, online daters struggle to evaluate personality traits of potential partners using profile pages and private messaging in these systems. Meanwhile, Multiplayer Online Games (MOGs) have emerged as a popular way young people find romantic partners for relationships in the physical world. We conducted two interview studies -- one concerning evaluation behavior in online dating systems (n=41) and the other concerning collaborative activities in MOGs (n=35). Insights from these studies reveal the weaknesses in evaluation tools native to online dating and suggest that collaborative activities could potentially address evaluation challenges in online dating systems. The paper concludes with a discussion of a series of design concepts for online dating systems in order to improve users' abilities to evaluate their potential romantic partners for in-person meetings.",
        "keywords": "",
        "authors": [
            {
                "name": "Douglas Zytko"
            },
            {
                "name": "Guo Z Freeman"
            },
            {
                "name": "Sukeshini A Grandhi"
            },
            {
                "name": "Susan Herring"
            },
            {
                "name": "Quentin (Gad) Jones"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw303": {
        "title": "The Effects of Pay-to-Quit Incentives on Crowdworker Task Quality",
        "abstract": "Companies such as Zappos.com and Amazon.com provide financial incentives for newer employees to quit. The premise is that workers who will accept this offer are misaligned with their company culture, which will therefore negatively affect quality over time. Could this pay-to-quit incentive scheme align workers in online labor markets? We conduct five empirical experiments evaluating different pay-to-quit incentives with crowdworkers and evaluate their effects on mean task accuracy, retention rate, and improvement in mean task accuracy. We find that the number of times a user is prompted for the inducement, the type and frequency of performance feedback given to participants, the type of incentive, as well as the amount offered can help retain high-performing workers but encourage poor-performing workers to quit early. When we combine the best features from our experiments and examine their aggregate effectiveness, mean task accuracy is improved by 28.3%. Last, we also find that certain demographics contribute to the effectiveness of pay-to-quit incentives.",
        "keywords": "",
        "authors": [
            {
                "name": "Christopher G Harris"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 1,
        "bestPaperNominee": 0
    },
    "cscw304": {
        "title": "Collective Smile: Measuring Societal Happiness from Geolocated Images",
        "abstract": "The increasing adoption of social media provides unprecedented opportunities to gain insight into human nature at vastly broader scales. Specifically regarding the study of population-wide sentiment, prior research commonly focuses on text-based analyses and ignores a treasure trove of sentiment-laden content: images. In this paper, we make methodological and computational contributions by introducing the Smile Index as a formalized measure of societal happiness. Detecting smiles in 9 million geo-located tweets over 16 months, we validate our Smile Index against both text-based techniques and self-reported happiness. We further make observational contributions by applying our metric to explore temporal trends in sentiment, relate public mood to societal events, and predict economic indicators. Reflecting upon the innate, language-independent aspects of facial expressions, we recommend future improvements and applications to enable robust, global-level analyses. We conclude with implications for researchers studying and facilitating the expression of collective emotion through socio-technical systems.",
        "keywords": "",
        "authors": [
            {
                "name": "Saeed Abdullah"
            },
            {
                "name": "Elizabeth L Murnane"
            },
            {
                "name": "Jean Costa"
            },
            {
                "name": "Tanzeem Choudhury"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw309": {
        "title": "Navigating Imagined Audiences: Motivations for Participating in the Online Public Sphere",
        "abstract": "Little is known about why and how people use multiple social media platforms for political participation, or about the contexts through which social media is appropriated. This paper reports on a qualitative interview study of social media use by politically interested citizens. We interviewed 27 residents of the state of Hawaii who integrated one or more social media tools into their daily lives to participate in the online public sphere. Different social media environments offer both different affordances for action and different audiences, and we describe how media choice is driven by the match between motivations and affordances, and also by the imagined audience. We identified a number of motivations including understanding different viewpoints, formulating perspectives, engaging in positive discourse, repairing Hawaii's image, increasing political awareness and improving civic engagement. We discuss how these goals relate to both intrinsic and extrinsic motivations.",
        "keywords": "",
        "authors": [
            {
                "name": "Bryan C Semaan"
            },
            {
                "name": "Heather A Faucett"
            },
            {
                "name": "Scott P Robertson"
            },
            {
                "name": "Misa Maruyama"
            },
            {
                "name": "Sara Douglas"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw312": {
        "title": "Crowdfunding for Science: Sharing Research with an Extended Audience",
        "abstract": "Crowdfunding is changing how, why, and which research projects are pursued. With the increasing number of crowdfunded research projects, it is important to understand what drives scientists to launch crowdfunding campaigns and how it affects their work. To better understand this re-cent phenomenon, we present a grounded theory of how and why scientists crowdfund. Through 27 semi-structured interviews, we find that scientists are motivated to crowd-fund in order to share their work and engage the public in the research process in ways traditional science work has not offered. Scientists also perceive crowdfunding as a more accessible way to get funds quickly compared to ex-isting fundraising mechanisms, such as grant applications. However, they must learn to use more accessible language to successfully communicate their research through social media to a broad audience of non-scientists and profession-al peers. Based on these findings, we discuss design impli-cations to inform future crowdfunding platforms and sup-port tools.",
        "keywords": "",
        "authors": [
            {
                "name": "Julie S Hui"
            },
            {
                "name": "Elizabeth M Gerber"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw319": {
        "title": "G4C: A Crowdsourcing Game Platform for the Enterprise",
        "abstract": "In this paper, we present a crowdsourcing game platform that allows users to play, create, and share simple games that harness the collective intelligence of employees within the enterprise. The platform uses the wizard design pattern to guide users through the process of creating a game. We describe the platform in detail and report our findings from deploying it within a large global organization for a period of three months, in which 34 games were created by 25 employees and played by 339. We combine qualitative and quantitative analysis to understand the characteristics of the different games and their impact on popularity and engagement, to validate our design goals, and to suggest potential enhancements. ",
        "keywords": "",
        "authors": [
            {
                "name": "Ido Guy"
            },
            {
                "name": "Anat Hashavit"
            },
            {
                "name": "Yaniv Corem"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw326": {
        "title": "On Becoming a Counsellor: Challenges and Opportunities To Support Interpersonal Skills Training",
        "abstract": "Well-developed interpersonal skills are crucial for all social interactions. However, understanding how interpersonal skills are taught or learned, and how technology can play a part in this, is yet an under-researched area in CSCW and HCI research. To start addressing this gap, our research explores the learning processes of counselling students, for whom developing interpersonal skills forms a fundamental part of their university education. We followed an iterative process to gain an in-depth understanding of this context, combining interviews and low-fidelity technology prompts. Overall, 26 participants comprising tutors, students and expert counsellors took part. Our findings first provide insights into the highly collaborative and social learning process of the students. We highlight the complexity of interpersonal reflection as a crucial process for developing counselling skills, and identify the challenges to learning that students face. Second, we build on this understanding to draw out empirically grounded design considerations around opportunities for technology innovation in this setting.",
        "keywords": "",
        "authors": [
            {
                "name": "Petr Slovák"
            },
            {
                "name": "Anja Thieme"
            },
            {
                "name": "Paul R Tennent"
            },
            {
                "name": "Patrick Olivier"
            },
            {
                "name": "Geraldine Fitzpatrick"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw331": {
        "title": "MoodLight: Exploring Personal and Social Implications of Ambient Display of Biosensor Data",
        "abstract": "MoodLight is an interactive ambient lighting system that responds to biosensor input related to an individual's current level of arousal. Changes in levels of arousal correspond to fluctuations in the color of light provided by the system, altering the immediate environment in ways intimately related to the user's private internal state. We use this intervention to explore personal and social implications of the ambient display of biosensor data. A design probe study conducted with university students provided the opportunity to observe MoodLight being used by individuals and dyads. Discussion of findings highlights key tensions associated with the dialectics of technology-mediated self-awareness and automated disclosure of personal information, addressing issues of agency, skepticism and uncertainty. This study provides greater understanding of the ways in which the representations of personal informatics, with a focus on ambient feedback, influence our perceptions of ourselves and those around us. ",
        "keywords": "",
        "authors": [
            {
                "name": "Jaime Snyder"
            },
            {
                "name": "Mark Matthews"
            },
            {
                "name": "Jacqueline Chien"
            },
            {
                "name": "Pamara F Chang"
            },
            {
                "name": "Emily Sun"
            },
            {
                "name": "Saeed Abdullah"
            },
            {
                "name": "Geri Gay"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw332": {
        "title": "Simulating Marriage: Gender Roles and Emerging Intimacy in an Online Game",
        "abstract": "Virtual marriage is a complex social activity in virtual worlds, yet it has received relatively little research attention. What happens when an important relationship such as marriage is transformed into gameplay? In this paper we present an empirical study of how players perceive, experience, and interpret their in-game marriages, especially with regard to representations of gender and sexuality, in an online game (Audition) where a ludological simulation of marriage is centrally embedded in gameplay. Findings reveal that marriage-as-ludic-rule-system and marriage-as-significant-sociocultural-institution provide a double set of gameplay/social/psychosexual resources that players collaboratively learn and perform, and that this negotiation is a source of pleasure, frustration, and meaning in the game. These findings can contribute to understanding the specificity and heterogeneity of players' gender representation in virtual worlds and inform the design of mixed reality games that simulate important life events for learning. ",
        "keywords": "",
        "authors": [
            {
                "name": "Guo Z Freeman"
            },
            {
                "name": "Jeffrey Bardzell"
            },
            {
                "name": "Shaowen Bardzell"
            },
            {
                "name": "Susan Herring"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw340": {
        "title": "I would like to..., I shouldn't..., I wish I...: Exploring behavior-change goals for social networking sites",
        "abstract": "Despite the benefits and uses of social networking sites (SNSs), users are not always satisfied with their behaviors on the sites. We perform a 604-participant online survey to explore SNS users' behavior-change goals for these sites. We find that while some participants want to reduce site use, others want to improve their use of the SNSs or increase a range of behaviors. These desired changes differed by SNS, and, for Twitter, by participants' levels of site use. Participants also expect to gain a range of benefits from these goals, including increased time, contact with others, intrinsic benefits, better security/privacy, and improved self presentation. Based on these results we provide insights both into how participants perceive different SNSs as impacting their lives, as well as potential designs for SNS behavior-change technologies.",
        "keywords": "",
        "authors": [
            {
                "name": "Manya Sleeper"
            },
            {
                "name": "Alessandro Acquisti"
            },
            {
                "name": "Lorrie F Cranor"
            },
            {
                "name": "Patrick Gage Kelley"
            },
            {
                "name": "Sean A Munson"
            },
            {
                "name": "Norman Sadeh"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw342": {
        "title": "Connecting in the Kitchen: An Empirical Study of Physical Interactions while Cooking Together at Home",
        "abstract": "Recent research has explored the role technology might play in future kitchens, including virtually dining together, recipe sharing, augmented kitchen furniture, reactive cooking utensils and gestural interaction. When people come together in a kitchen to cook it is about more than just production of sustenance -- it is about being together, helping each other, exchanging stories, and contributing to the gradual emergence of a shared meal. In this paper we present a digital ethnography of how people coordinate and cooperate in their kitchens when cooking together for the purpose of inspiring the design of social natural user interactions for technologies in the kitchen. The study is based on 61 YouTube videos of people cooking together analyzed using the frameworks of proxemics and F-formations. Our findings unfold and illustrate relationships between people's spatial organization, their cooking activities and physical kitchen layouts. Based on these we discuss the kitchen as a design space and particularly the opportunities for social natural user interaction design.",
        "keywords": "",
        "authors": [
            {
                "name": "Jeni Paay"
            },
            {
                "name": "Jesper Kjeldskov"
            },
            {
                "name": "Mikael B. Skov"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw343": {
        "title": "Reliving the Past & Making a Harmonious Society Today: A Study of Elderly Electronic Hackers in China",
        "abstract": "This paper tells a story of DIY (do it yourself) making that does not neatly fit more familiar narratives of making as individual empowerment, a democratizing force, and technoscientific innovation. Drawing on ethnographic research with a collective of elderly electronic hackers in China, we provide insights into the socio-technical and politico-economic processes of hacking and making. The paper examines how making functioned, for the elderly DIY enthusiasts, as way of remaking and reliving the past, as a site express class belonging and citizenship. We show that making and hacking is not practiced in a void independent of social, political or economic forces. Rather, as this paper demonstrates, making unfolds in relation to and is contingent on societal norms and specific techno-cultural histories. As much as hacking empowers certain people so does it exclude others and function as a site of exercise of power and social distinction making.",
        "keywords": "",
        "authors": [
            {
                "name": "Yuling Sun"
            },
            {
                "name": "Silvia Lindtner"
            },
            {
                "name": "Xianghua Ding"
            },
            {
                "name": "Tun Lu"
            },
            {
                "name": "Ning Gu"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 1,
        "bestPaperNominee": 0
    },
    "cscw350": {
        "title": "The Effects of View Portals on Performance and  Awareness in Co-Located Tabletop Groupware",
        "abstract": "Tabletop work surfaces have natural advantages for collaboration, but also have constraints that can make group work difficult. View portals are one way to provide access to other parts of a table surface, and as a way to re-orient content for group members in different locations; however, there is little research on whether portals improve group performance, how much they help, and whether they change other aspects of collaboration. We report on studies that evaluate the effects of portals on group performance and behavior. Our first study showed significant performance advantages for portals: people completed tasks more quickly and with more equal division of labor. Our second study showed that people used portals extensively and saw them as valuable, but that they affected people's ability to maintain awareness, coordinate access to objects, and understand the organization of the workspace. Our work demonstrates benefits and drawbacks of table portals, and suggests that designers must consider both individual and group needs before implementing tabletop view augmentations.",
        "keywords": "",
        "authors": [
            {
                "name": "Carl Gutwin"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw358": {
        "title": "Two is Better Than One: Improving Multilingual Collaboration by Giving Two Machine Translation Outputs",
        "abstract": "Machine translation (MT) creates both opportunities and challenges for multilingual collaboration: While MT enables collaborators to communicate via their native languages, it can introduce errors that make communication difficult. In the current paper, we examine whether displaying two alternative translations for each message will improve conversational grounding and task performance. We conducted a laboratory experiment in which monolingual native English speakers collaborated with bilingual native Mandarin speakers on a map navigation task. Each dyad performed the task in one of three communication conditions: MT with single output, MT with two outputs, and English as a common language. Dyads given two translations for each message communicated more efficiently, and performed better on the task, than dyads given one translation. Our findings show the value of providing multiple translations in multilingual collaboration, and suggest design features of future MT-based collaboration tools.   ",
        "keywords": "",
        "authors": [
            {
                "name": "Ge Gao"
            },
            {
                "name": "Bin Xu"
            },
            {
                "name": "David C Hau"
            },
            {
                "name": "Zheng Yao"
            },
            {
                "name": "Dan Cosley"
            },
            {
                "name": "Susan R Fussell"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw363": {
        "title": "Dwelling Places in KakaoTalk: Understanding the Roles and Meanings of Chatrooms in Mobile Instant Messengers",
        "abstract": "Recently, a great amount of conversation is taking place through mobile instant messaging (MIM) applications. The emergence of mobile messengers has enabled people to spend significant time in MIM, dwelling with close people. To investigate how this persistent use of chatrooms shaped the roles and meanings of MIM chatrooms, we conducted semi-structured interviews with ten users of KakaoTalk, one of the most popular MIM applications in South Korea. By understanding how participants determine the notion of centrality in MIM, we discovered three functional regions, namely, primary, secondary, and tertiary regions, which respectively support different functions not only in communication, but also in social interaction with various types of relationships: performing everyday life, connecting to the maintained social capital, and connecting to the expired relationship. Based on the meanings and user behaviors in those regions, we highlight two approaches that would trigger a new perspective in the design of messaging applications.",
        "keywords": "",
        "authors": [
            {
                "name": "Da-jung Kim"
            },
            {
                "name": "Youn-kyung Lim"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw364": {
        "title": "In the Flow, Being Heard, and Having Opportunities: Sources of Power and Power Dynamics in Global Teams",
        "abstract": "In our qualitative study of 9 globally distributed software development teams, we found that power and how it was distributed across locations had a significant effect on team dynamics. We describe the sources of power for these teams, which include being in the flow of information, feeling that one's voice is heard by decision makers, and having opportunities for career growth and advancement. We also examine power dynamics across locations by team and show that having more balanced power was typically associated with more power struggles rather than fewer. Four of the 9 teams had ongoing power contests. Each of these teams had some sources of power at one location and other sources of power at the other location. Both sites worried about losing power, felt they should have more, and struggled against losing ground. We conclude with a discussion of how CSCW systems might support globally distributed teams in creating more equal access to more sources of power and alleviating unhealthy power dynamics.",
        "keywords": "",
        "authors": [
            {
                "name": "Pamela J Hinds"
            },
            {
                "name": "Daniela Retelny"
            },
            {
                "name": "Catherine Cramton"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw365": {
        "title": "Taking our Time: Chronic Illness and Time-Based Objects in Families",
        "abstract": "This study examined the use of time-based objects by patients and their families to manage chronic illnesses at home. Calendar systems and medication containers, the main types of time-based objects studied, were used as part of two family-based collaborative work practices: 1) prompting health management activities, and 2) safeguarding these activities. Additionally, these artifacts were part of two social interaction patterns that managed emotional intimacy: 1) expressing support, and 2) hiding and disguising illness. Accordingly, home-based illness management may be more collaborative than previously recognized. Moreover, through their interactive incorporation into family life, time-based objects are laden with psychosocial significance. Breakdowns in temporal support were also evident, and were accompanied by: missed medication events; rationing of medications; medication errors; and difficulties with preparation for medical appointments. We propose novel artifact designs to better support patients and their families in managing the temporal aspects of chronic illness together.",
        "keywords": "",
        "authors": [
            {
                "name": "Andrea Barbarin"
            },
            {
                "name": "Tiffany C Veinot"
            },
            {
                "name": "Predrag V Klasnja"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw371": {
        "title": "\"I'm Not Like My Friends\": Understanding How Children with a Chronic Illness Use Technology to Maintain Normalcy",
        "abstract": "Children diagnosed with a chronic illness, such as cancer, experience a vastly different childhood than their healthy counterparts. They may struggle with accepting that they are no longer seen as \"normal\". We surveyed 10 children who have a chronic illness and interviewed 15 healthcare professionals and 7 parents of chronically ill children to understand their communication practices and challenges of how these patients stay connected with their peers. We found that due to the nature of their illness and constant hospitalization, pediatric patients often use various communication technologies to stay in touch with friends and try to maintain normalcy in their lives. Some patients also had to create a \"new normal\" that balanced life before and after being diagnosed. Based on these results, we suggest opportunities for technology to help patients connect to others and retain a sense of normalcy or to encourage them to embrace their \"new normal\".",
        "keywords": "",
        "authors": [
            {
                "name": "Leslie S Liu"
            },
            {
                "name": "Kori M Inkpen"
            },
            {
                "name": "Wanda Pratt"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw380": {
        "title": "Connected Through Crisis: Emotional Proximity and the Spread of Misinformation Online",
        "abstract": "During crises, the ability to access relevant information is extremely important for those affected. Previous research shows that social media have become popular for rapid information exchange between members of the online community after crisis events. This study focuses on the effects of proximity to a crisis on information sharing behaviors. Using constructivist grounded theory to guide our inquiry, we conducted interviews with eleven people who used social media in the aftermath of the 2013 Boston Marathon Bombings. Salient themes emerging from this study suggest that both physical and emotional proximity to a crisis influence online information seeking and sharing behaviors. Additionally, speed of information sharing and information access renders social media especially useful during crisis and particularly susceptible to the spread of misinformation. We view the latter as a consequence of the inevitable sensemaking process that occurs as individuals attempt to make sense of incomplete information.",
        "keywords": "",
        "authors": [
            {
                "name": "Y. Linlin Huang"
            },
            {
                "name": "Kate Starbird"
            },
            {
                "name": "Mania Orand"
            },
            {
                "name": "Stephanie A Stanek"
            },
            {
                "name": "Heather Pedersen"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw383": {
        "title": "Who owns your social networks?",
        "abstract": "In this paper, we present the results of a study examining 244 participants' attitudes about the value, ownership, and control of social network data. We use Facebook-based scenarios to elicit reactions to hypothetical statements about saving social network content that belongs to others, reusing, repurposing, and monetizing social network data, and removing social network content that is not specifically one's own. Participants also report on their own practices in each of these areas. Findings not only address issues related to ownership, but also explore the use of social networks as documentary records, and the discrepancies between participants' perceptions of how they would like their social network content to be used, and how it is actually used.",
        "keywords": "",
        "authors": [
            {
                "name": "Catherine C Marshall"
            },
            {
                "name": "Frank M Shipman"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw386": {
        "title": "Privacy as articulation work in HIV health services",
        "abstract": "Normative accounts on health information privacy often highlight the importance of regulating data sharing. Yet, little attention has been paid to how health professionals perform and negotiate privacy practices in highly multidisciplinary, technologically-mediated medical work. This paper examines information privacy practices in two HIV outpatient clinics based in two NHS hospitals in London (UK). Methods include 46 semi-structured interviews, primarily with health professionals and technology developers, ethnographic observation and document analysis. Drawing on an empirically informed understanding of privacy as 'articulation work', we focus on the indeterminate nature of information privacy practices and examine the work required to translate privacy, from a normative professional duty to an enacted medical practice. This analysis also highlights the invisibility of privacy practices and their coordinating role in delivering technologically-supported medical care. The paper ends with a discussion of implications for practice and technology design. ",
        "keywords": "",
        "authors": [
            {
                "name": "Chrysanthi Papoutsi"
            },
            {
                "name": "Ian Brown"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw389": {
        "title": "The Group Context Framework: An Extensible Toolkit for Opportunistic Grouping and Collaboration",
        "abstract": "In this paper, we present the Group Context Framework (GCF), a general-purpose toolkit that allows mobile devices to share contextual information in an opportunistic manner. GCF provides a standardized way for developers to request contextual data for their applications. The framework then intelligently forms groups with other devices to satisfy these requirements. Through two prototypes, we demonstrate how GCF can be used to support a broad range of collaborative and cooperative tasks. We then show how our framework's architecture allows devices to opportunistically detect and collaborate with one another, even when running different applications. Finally, we present two real-world domains that demonstrate how GCF's ability to form groups increases users' access to relevant and timely information, and discuss possible incentives and safeguards to context sharing from a user privacy standpoint.",
        "keywords": "",
        "authors": [
            {
                "name": "Adrian A de Freitas"
            },
            {
                "name": "Anind K Dey"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw392": {
        "title": "Searchable Objects: Search in Everyday Conversation",
        "abstract": "This paper examines mobile internet search, presenting  search not as a process of information retrieval, but as part of conversation and talk. Through video extracts of mobile search we explore how mobile phones are interwoven into talk, and how searchers manage the participation of other conversationalists alongside the search itself. We introduce the notion of a 'searchable object' -- an object that arises in conversation that can be searched for online -- and document how such an object occasions a search.  In turn we discuss the differing roles of the device 'driver' and 'passenger', and how participation is managed through questions and narration. Rather than search being solely about getting the correct information, the conversations that search can be part of may be just as important. We conclude by critiquing some of the pessimistic views of interaction around mobile phones and their use in ordinary life and talk.",
        "keywords": "",
        "authors": [
            {
                "name": "Barry Brown"
            },
            {
                "name": "Moira McGregor"
            },
            {
                "name": "Donald McMillan"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw396": {
        "title": "Content, Context, and Critique: Commenting on a Data Visualization Blog",
        "abstract": "Online data journalism, including visualizations and other manifestations of data stories, has seen a recent surge of interest. User comments add a dynamic, social layer to interpretation, enabling users to learn from others' observations and social interact around news issues. We present the results of a qualitative study of commenting around visualizations published on a mainstream news outlet, The Economist's Graphic Detail blog. We find that surprisingly, only 42% of the comments discuss the visualization and/or article content. Over 60% of comments discuss matters of context, including how the issue is framed and the relation to outside data. Further, over one third of total comments provide direct critical feedback on the content of presented visualizations and text articles as well as on contextual aspects of the presentation. Our findings suggest using critical social feedback from comments in the design process, and lead to design implications for commenting interfaces.",
        "keywords": "",
        "authors": [
            {
                "name": "Jessica Hullman"
            },
            {
                "name": "Nicholas Diakopoulos"
            },
            {
                "name": "Elaheh Momeni"
            },
            {
                "name": "Eytan Adar"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw403": {
        "title": "Dissecting a Social Botnet: Growth, Content and Influence in Twitter",
        "abstract": "Social botnets become an important phenomenon on social media. There are many ways in which social bots can disrupt or influence online discourse, such as, spam hashtags, scam twitter users, and astroturfing. In this paper we considered one specific social botnet in Twitter to understand how it grows over time, how the content of tweets by the social botnet differ from regular users in the same dataset, and lastly, how the social botnet may have influenced the relevant discussions. Our analysis is based on a qualitative coding for approximately 3000 tweets in Arabic and English from the Syrian social bot that was active for 35 weeks on Twitter before it was shutdown. We find that the growth, behavior and content of this particular botnet did not specifically align with common conceptions of botnets. Further we identify interesting aspects of the botnet that distinguish it from regular users.",
        "keywords": "",
        "authors": [
            {
                "name": "Norah Abokhodair"
            },
            {
                "name": "Daisy Yoo"
            },
            {
                "name": "David W McDonald"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw405": {
        "title": "Do I Need To Follow You? Examining the Utility of The Pinterest Follow Mechanism",
        "abstract": "We examine the efficacy and relevance of the follow mechanism for content discovery on Pinterest. Pinterest is an Online Social Network (OSN) centered around the curation and sharing of visual content. The site encourages users to form ties with other users (follow) based on mutual interests. These ties are expected by Pinterest to be the means by which users discover and share interesting content. We collect a sample of user activity from the site and use it to determine whether users are indeed utilizing the follow mechanism for content discovery and curation. We find that, on average, only 12.3% of a user's followers interact with any of the user's pins. Conversely, > 75% of the activity on an average user's boards is done by non-followers. While 88% of unique users who interact with a user's content are non-followers, followers who do interact contribute almost 2.5 times more activity, on average, than non-followers. Our results strongly suggest [...]",
        "keywords": "",
        "authors": [
            {
                "name": "Bluma S Gelley"
            },
            {
                "name": "Ajita John"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw412": {
        "title": "Using Groups of Items to Bootstrap New Users in Recommender Systems",
        "abstract": "To achieve high quality initial personalization, recommender systems must provide an efficient and effective process for new users to express their preferences. We propose that classical method -- asking users' preferences on individual items-is inefficient to convert a user's effort into personalization. Rather, we propose that users can begin by expressing their preferences for groups of items. We test this idea by designing and evaluating an interactive process where users express preferences across groups of items that are generated by clustering algorithms. We contribute a strategy for recommending items based on group preferences that is generalizable to any collaborative filtering-based system. We evaluate our process with both offline simulation methods and an online user experiment. We find that, as compared with a baseline rate-15-items interface, (a) users complete the preference elicitation process in less than half the time, and (b) users are more satisfied with the resulting recommendation. Our evaluation reveals several advantages and trade-offs involved in moving from item-based preference elicitation to group-based preference elicitation.",
        "keywords": "",
        "authors": [
            {
                "name": "Shuo Chang"
            },
            {
                "name": "Franklin M Harper"
            },
            {
                "name": "Loren G Terveen"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw415": {
        "title": "Towards Understanding Relational Orientation: Attachment Theory and Facebook Activities",
        "abstract": "Knowing individuals' relational orientation is imperative for effective offline, as well as online, interactions and collaborations. We use attachment theory to examine the link between Facebook users' relational orientation (in terms of attachment styles: anxiety and avoidance) and their relational activities. Our research examines whether and how the two key relational processes identified in offline social relationships (self-expression and responsiveness) are manifested on online social networks and related to attachment styles. We describe our dataset of 640 Facebook users, their attachment scale survey results, and their 525,334 posts. We define four features that map onto relational activities on Facebook: self-expression and responsiveness. We find significant relationships between the users' attachment styles and their self-expression and responsiveness activities on Facebook. A key takeaway of our research is that without relying on self-reported surveys, a computational analysis of a Facebook user's self-expressing and responding activities alone can reveal the user's underlying relational orientation (i.e., attachment style).",
        "keywords": "",
        "authors": [
            {
                "name": "Bumsoo Kang"
            },
            {
                "name": "Sujin Lee"
            },
            {
                "name": "Junehwa Song"
            },
            {
                "name": "Seungwoo Kang"
            },
            {
                "name": "Inseok Hwang"
            },
            {
                "name": "Alice Oh"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw417": {
        "title": "Planning with Crowdsourced Data: Rhetoric and Representation in Transportation Planning",
        "abstract": "We are in the midst of a new era of experimentation that blends social and mobile computing in support of digital democracy. These experiments will have potentially long lasting consequences on how the public is invited to participate in governance by elected as well as professional officials. In this paper, we look at how data from a purpose-built smartphone app we deployed were incorporated into a three-day urban planning event. The data collected was meant to help inform design decisions for new cycling infrastructure and to provide an alternate means for participating in the planning process. Through our analysis, we point to three distinct roles the data played at the event -- as authority, as evidence, and as ambivalent. Each role demonstrates the challenge and potential for turning to crowdsourced data as a form of participation and as a re-source for urban planning. ",
        "keywords": "",
        "authors": [
            {
                "name": "Christopher A Le Dantec"
            },
            {
                "name": "Mariam Asad"
            },
            {
                "name": "Aditi Misra"
            },
            {
                "name": "Kari Watkins"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw419": {
        "title": "Using Multiple Contexts to Detect and Form Opportunistic Groups",
        "abstract": "We present a new technique that allows mobile devices to opportunistically group with one another, thus improving their ability to facilitate one-time or spontaneous exchanges of information. In our approach, devices share context with each other, and form groups when these readings are found to be similar to one another. Through a formative study, we examine the limitations of using a single type of context to form groups, and show how leveraging multiple contexts improves our ability to detect and form relevant groupings. We then present DIDJA, a robust software toolkit that automatically collects and analyzes contextual information in order to find and form groups. Through two prototypes, we demonstrate how DIDJA enhances existing user experiences, and show how developers can use our toolkit to easily facilitate frictionless collaborations between users and their environment. We then perform an extended experiment and show how DIDJA is able to accurately form groups under realistic conditions.",
        "keywords": "",
        "authors": [
            {
                "name": "Adrian A de Freitas"
            },
            {
                "name": "Anind Dey"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw421": {
        "title": "Flock: Hybrid Crowd-Machine Learning Classifiers",
        "abstract": "We present hybrid crowd-machine learning classifiers: classification models that start with a written description of a learning goal, use the crowd to suggest predictive features and label data, and then weigh these features using machine learning to produce models that are accurate and use human-understandable features. We embed this approach in an interactive machine learning platform called Flock. Hybrid classifiers enable fast prototyping of machine learning models that can improve on both algorithm performance and human judgment, and accomplish tasks where automated feature extraction is not yet feasible. The crowd's efforts can be focused on specific subsets of the input space or instead used to partition the input space and improve algorithm performance in subregions. An evaluation on six prediction tasks demonstrated that aggregating crowd features improves upon both asking the crowd for a direct prediction and off-the-shelf machine learning features by over 10%. Further, hybrid systems that use both crowd-nominated and machine-extracted features can outperform those that use either in isolation.",
        "keywords": "",
        "authors": [
            {
                "name": "Justin Cheng"
            },
            {
                "name": "Michael S Bernstein"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw424": {
        "title": "Social Barriers Faced by Newcomers Placing Their First Contribution in Open Source Software Projects",
        "abstract": "Newcomers' seamless onboarding is important for online communities that depend upon leveraging the contribution of outsiders. Previous studies investigated aspects of the joining process and motivation in open collaboration communities, but few have focused on the barriers newcomers face when placing their first contribution. This is important for Open Source Software (OSS) projects, which receive contributions from many one-time contributors. Focusing on OSS, our study qualitatively analyzed social barriers that hindered newcomers' first contributions. We defined a conceptual model composed of 58 barriers including 13 social barriers. The barriers were identified from a qualitative data analysis considering different sources: a literature review; open question responses from OSS contributors; students contributing to OSS projects; and semi-structured interviews with developers from 14 different projects. This paper focuses on social barriers and its contributions include gathering empirical evidence of the barriers faced by newcomers, organizing and better understanding these barriers, surveying the literature from the perspective of the barriers, and identifying new potential research streams.",
        "keywords": "",
        "authors": [
            {
                "name": "Igor Steinmacher"
            },
            {
                "name": "Tayana Conte"
            },
            {
                "name": "Marco A Gerosa"
            },
            {
                "name": "David Redmiles"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw428": {
        "title": "Making \"Safe\": Community-Centered Practices in a Virtual World Dedicated to Children with Autism",
        "abstract": "The use of online games and virtual worlds is becoming increasingly prominent, particularly among children and young adults. Parents have concerns about risks their children might encounter in these online spaces. Parents dynamically manage the boundaries between safe and unsafe spaces online through both explicit and implicit means. In this work, we use empirical data gathered from a digital ethnography of Autcraft to explore how parents of children with autism continually create a \"safe\" virtual world through both implicit and explicit means. In particular, we demonstrate how their actions in these spaces define and produce \"safety,\" shedding light on our theoretical understanding of child safety in online spaces.",
        "keywords": "",
        "authors": [
            {
                "name": "Kathryn E Ringland"
            },
            {
                "name": "Christine T Wolf"
            },
            {
                "name": "Lynn S Dombrowski"
            },
            {
                "name": "Gillian Hayes"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw429": {
        "title": "Understanding Student Motivation, Behaviors and Perceptions in MOOCs",
        "abstract": "Massive Open Online Courses (MOOCs) have recently experienced rapid development and garnered significant attention from various populations including student, educators, practitioners and researchers. Despite the wide recognition of MOOCs as an important opportunity within educational practices, there are still many questions as to how we might satisfy students' needs, as evidenced by very high dropout rates. Researchers lack a solid understanding of what student needs are being addressed by MOOCs, and how well MOOCs now address (or fail to address) these needs. To help in building such an understanding, we conducted in-depth interviews probing student motivations, learning perceptions and experiences towards MOOCs, paying special attention to the MOOC affordances and experiences that might lead to high drop rates. In our analysis of the interviews, we identified four types of learning motivation, five learning patterns, and a number of factors that appear to influence student retention. We discuss these findings and their design implications.",
        "keywords": "",
        "authors": [
            {
                "name": "Saijing Zheng"
            },
            {
                "name": "Mary Beth Rosson"
            },
            {
                "name": "Patrick C Shih"
            },
            {
                "name": "John M Carroll"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw430": {
        "title": "Think Local, Retweet Global: Retweeting by the Geographically-Vulnerable during Hurricane Sandy",
        "abstract": "Hurricane Sandy wrought $6 billion in damage, took 162 lives, and displaced 776,000 people after hitting the US Eastern seaboard on October 29, 2012. Because of its massive impact, the hurricane also spurred a flurry of social media activity, both by the population immediately affected and by the globally convergent crowd. In this paper we explore how retweeting activity of the geographically vulnerable differs (if at all) from that of the general Twitter population. We investigate whether they spread information differently, including what and whose content they chose to propagate. We investigate whether the Twitter-based relationships are preexisting or if they are newly formed because of the disaster, and if so if they persist. We find that the people in the path of the disaster favor in their retweeting locally-created tweets and those with locally-actionable information. They also form denser networks of information propagation during disaster than before or after. ",
        "keywords": "",
        "authors": [
            {
                "name": "Marina Kogan"
            },
            {
                "name": "Leysia Palen"
            },
            {
                "name": "Kenneth M Anderson"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw432": {
        "title": "Learnersourcing Subgoal Labels for How-to Videos",
        "abstract": "Websites like YouTube host millions of how-to videos, but the interfaces are not optimized for learning. Previous research suggests that users learn more from how-to videos when the information from the video is presented in outline form, with individual steps and labels for groups of steps (subgoals) shown. We envision an alternative video player where the steps and subgoals are displayed alongside the video. To generate this information for existing videos, we propose a learnersourcing approach, where people actively learning from a video provide such information. To demonstrate this method, we created a workflow where learners contribute and refine subgoal labels for how-to videos. We deployed a live website with our workflow implemented on a set of introductory web programming videos. For the four videos with the highest participation, we found that a majority of learner-generated subgoals were comparable in quality to expert-generated ones. Learners commented that the system helped them grasp the material, suggesting that our workflow did not detract from the learning experience.",
        "keywords": "",
        "authors": [
            {
                "name": "Sarah Weir"
            },
            {
                "name": "Juho Kim"
            },
            {
                "name": "Krzysztof Z Gajos"
            },
            {
                "name": "Robert C Miller"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw436": {
        "title": "Not Really There: Understanding Embodied Communication Affordances in Team Perception and Participation",
        "abstract": "We conducted a study that compared basic video conferencing, emergent kinetic video-conferencing techniques, and face-to-face meetings. Remote and co-located participants worked together in groups of three. We show, in agreement with prior literature, the strong adverse impact of being remote on participation levels. We also show that local and remote participants perceived differently their own contributions and others'. Local participants exhibited significantly more overlapping talk with remote participants who used an embodied proxy, than with remote participants in basic-video conferencing (and at a rate similar to overlapping speech for co-located groups). We describe differences in how the technologies were used to follow conversation. Our findings suggest that while the kinetic embodied technology increased local participants' perceived presence of remote teammates, it did not enhance remote participants' own sense of telepresence. We discuss our findings in the context of theories of agency and presence, and discuss how these findings extend our understanding of the promise and limitations of embodied video-conferencing solutions.",
        "keywords": "",
        "authors": [
            {
                "name": "Jacob T Biehl"
            },
            {
                "name": "Daniel Avrahami"
            },
            {
                "name": "Anthony Dunnigan"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw438": {
        "title": "Focused, Aroused, but so Distractible:  Temporal Perspectives on Multitasking and Communications",
        "abstract": "A common assumption in studies of interruptions is that one is focused in an activity and then distracted by other stimuli. We take the reverse perspective and examine whether one might first be in an attentional state that makes one susceptible to communications typically associated with distraction. We explore the confluence of multitasking and workplace communications from three temporal perspectives -- prior to an interaction, when tasks and communications are interleaved, and at the end of the day. Using logging techniques and experience sampling, we observed 32 employees in situ for five days. We found that certain attentional states lead people to be more susceptible to particular types of interaction. Rote work is followed by more Facebook or face-to-face interaction. Focused and aroused states are followed by more email. Switching projects and Internet switching increases with Facebook and Email use, which are also associated with a lower reported end-of-day productivity. We discuss how emotional homeostasis can explain the results and discuss implications for multitasking research.",
        "keywords": "",
        "authors": [
            {
                "name": "Gloria Mark"
            },
            {
                "name": "Shamsi T Iqbal"
            },
            {
                "name": "Mary P Czerwinski"
            },
            {
                "name": "Paul R Johns"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw439": {
        "title": "Authenticity, Relatability and Collaborative Approaches to Sharing Knowledge about Assistive Living Technology",
        "abstract": "Health and care providers are increasingly looking to online and peer-to-peer services to supplement existing channels of assistive living technology (ALTs) provision and assessment. We describe the findings from 12 co- design workshops with 28 people from the UK representing a range of older people with and without health conditions, users of ALT and carers for people using such devices. The workshops were conducted to explore issues related to finding reliable information about ALT with the goal of gathering requirements for the design of a collaborative peer-to-peer knowledge sharing platform. Our analysis highlights how a current reliance on peers and informal networks relates to a desire to establish the authenticity and relatability of another person's experience to one's own circumstances. We use these findings to develop implications for the design of online platforms meeting the need for relatability in peer-to-peer exchanges of information, and suggest directions for future research based on infrastructuring localised ALT resources.",
        "keywords": "",
        "authors": [
            {
                "name": "John Vines"
            },
            {
                "name": "Peter C Wright"
            },
            {
                "name": "David Silver"
            },
            {
                "name": "Maggie Winchcombe"
            },
            {
                "name": "Patrick Olivier"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw443": {
        "title": "Hacking Culture, Not Devices: Access and Recognition in Feminist Hackerspaces",
        "abstract": "This paper examines the motivations, activities, and ideals of people organizing feminist hackerspaces: collaborative workspaces developed to support women's creative and professional pursuits. Drawing on interviews, participant observation and archival data collected across the Pacific Northwest over nine months, we show how members of these spaces use small-scale collaborative design and acts of making to work out their place in society in ways that contest widely accepted understandings of hacking, technology, and collaboration. In designing how the space should look, feel, and run, members reframe activities seldom associated with technical work (e.g., weaving, identity workshops) as forms of hacking. In so doing, they shift concerns for women in technology from questions of access (who is included) to questions of recognition (who is visible) while grappling with productive ambiguities in be-tween. We describe lessons these tension present for examining women's relations with technology in CSCW.",
        "keywords": "",
        "authors": [
            {
                "name": "Sarah Fox"
            },
            {
                "name": "Rachel Rose R Ulgado"
            },
            {
                "name": "Daniela K Rosner"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw444": {
        "title": "KrishiPustak: A Social Networking System for Low-Literate Farmers",
        "abstract": "With the wide penetration of mobile internet, social networking (SN) systems are becoming increasingly popular in the developing world. However, most SN sites are text heavy, and are therefore unusable by low-literate populations. Here we ask what would an SN application for low-literate users look like and how would it be used? We designed and deployed KrishiPustak, an audio-visual SN mobile application for low-literate farming populations in rural India. Over a four month deployment, 306 farmers registered through the phones of eight agricultural mediators making 514 posts and 180 replies. We conducted interviews with farmers and mediators and analyzed the content to understand system usage and to drive iterative design. The context of mediated use and agricultural framing had a powerful impact on system understanding (what it was for) and usage. Overall, KrishiPustak was useful and usable, but none-the-less we identify a number of design recommendations for similar SN systems.",
        "keywords": "",
        "authors": [
            {
                "name": "Indrani Medhi-Thies"
            },
            {
                "name": "Pedro Ferreira"
            },
            {
                "name": "Nakull Gupta"
            },
            {
                "name": "Jacki O'Neill"
            },
            {
                "name": "Edward Cutrell"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw445": {
        "title": "The Role of Social Influence in Security Feature Adoption",
        "abstract": "Social influence is key in technology adoption, but its role in security-feature adoption is unique and remains unclear. Here, we analyzed how three Facebook security features -- Login Approvals, Login Notifications, and Trusted Contacts -- diffused through the social networks of 1.5 million people. Our results suggest that social influence affects one's likelihood to adopt a security feature, but its effect varies based on the observability of the feature, the current feature adoption rate among a potential adopter's friends, and the number of distinct social circles from which those feature-adopting friends originate. Curiously, there may be a threshold higher than which having more security-feature adopting friends predicts for higher adoption likelihood, but below which having more feature-adopting friends predicts for lower adoption likelihood. Furthermore, the magnitude of this threshold is modulated by the attributes of a feature -- features that are more noticeable (Login Approvals, Trusted Contacts) have lower thresholds.",
        "keywords": "",
        "authors": [
            {
                "name": "Sauvik Das"
            },
            {
                "name": "Adam D Kramer"
            },
            {
                "name": "Laura A Dabbish"
            },
            {
                "name": "Jason I Hong"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw447": {
        "title": "A User-Powered American Sign Language Dictionary",
        "abstract": "Students learning American Sign Language (ASL) have trouble searching for the meaning of unfamiliar signs. ASL signs can be differentiated by a small set of simple features including hand shape, orientation, location, and movement. In a feature-based ASL-to-English dictionary, users search for a sign by providing a query, which is a set of observed features. Because there is natural variability in the way signs are executed, and observations are error-prone, an approach other than exact matching of features is needed. We propose ASL-Search, an ASL-to-English dictionary entirely powered by its users. ASL-Search utilizes Latent Semantic Analysis (LSA) on a database of feature-based user queries to account for variability. To demonstrate ASL-Search's viability, we created ASL-Flash, a learning tool that presents online flashcards to ASL students and provides query data. Our simulations on this data serve as a proof of concept, demonstrating that our dictionary's performance improves with use and performs well for users with varied levels of ASL experience.",
        "keywords": "",
        "authors": [
            {
                "name": "Danielle Bragg"
            },
            {
                "name": "Kyle Rector"
            },
            {
                "name": "Richard E Ladner"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw452": {
        "title": "Bridge the Gap! What Can Work Design in Crowdwork Learn from Work Design Theories?",
        "abstract": "Integrating crowd-based systems to organizations is highly complex. A major of source of this complexity stems from the nature of organizational work design. Work design and configurations of work performance, in the traditional organizational model, are tightly woven into the structure and functions of organizations, whereas crowdwork leverages an undefined network of people without an organized managerial or hierarchical model. This paper examines work design theories in organizational studies with a view to exploring their potential for addressing the fundamental challenges of work design in organizational crowdwork. Drawing on literature review of studies of crowdwork and analysis of perspectives in work design theories, the paper outlines ways in which crowdsourcing research, on one hand, can interpret and utilize work design theories, and on the other, contribute to redesigning work design theories to keep pace with the important and rapid transformation of work from the traditional staffing paradigm to crowd and open models.",
        "keywords": "",
        "authors": [
            {
                "name": "Obinna Anya"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw457": {
        "title": "Visible but Unseen? A Workplace Study of Blood-Test Icons on Electronic Emergency-Department Whiteboards",
        "abstract": "Studies have shown that whiteboards support much cooperative work by for example strengthening awareness, improving communication, and reducing mental workload. In line with these predominantly positive findings, an emergency department (ED) turned to its whiteboard to improve the coordination of its work with blood tests. We investigate this use of the whiteboard through observations and informal interviews in the ED. We analyze the whiteboard's ability to support coordination and awareness in the work with blood tests. Our findings show limitations in the ability of the whiteboard to support awareness in a setting where the users are (locally) mobile, specifically in regard to information that requires continuous monitoring. We do however also find that the whiteboard safeguarded the work with blood tests against some risks by making blood-test information socially visible.",
        "keywords": "",
        "authors": [
            {
                "name": "Arnvør á Torkilsheyggi"
            },
            {
                "name": "Morten Hertzum"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw459": {
        "title": "Wireless Visions: Infrastructure, Imagination, and U.S. Spectrum Policy",
        "abstract": "Effective use of spectrum is essential to the forms of mobile, ubiquitous, and social computing that increasingly shape and define CSCW research. This paper calls attention to the key policy processes by which the future of wireless spectrum -- and the forms of technology design and use that depend on it -- is being imagined, shaped, and contested. We review CSCW and HCI scholarship arguing for infrastructure and policy as important but neglected sites of CSCW analysis, and separate lines of work arguing for 'sociotechnical imaginaries' as key sites and outcomes of technology policy and design. We then turn to histories of U.S. spectrum regulation, before analyzing ongoing FCC policy actions around incentive auctions and unlicensed spectrum use. We argue that such processes are central to the imagination and future of mobile computing; and that CSCW can benefit from adding such policy concerns to its traditional repertoires of design and use. ",
        "keywords": "",
        "authors": [
            {
                "name": "Richmond Y Wong"
            },
            {
                "name": "Steven Jackson"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw465": {
        "title": "Spending Time with Money: from shared values to social connectivity",
        "abstract": "There is a rapidly growing momentum driving the development of mobile payment systems for co-present interactions, using near-field communication on smartphones and contactless payment systems. The design imperative for this is to enable faster, simpler, effortless and secure transactions, yet our evidence shows that this focus on reducing friction may ignore important transactional features. We draw from empirical data to consider user interactions around financial exchanges on mobile phones. Our findings examine how the practices around making payments support people in making connections, to other people, to their communities, to the places they move through, to their environment, and to what they consume. While these social and community bonds shape the kinds of interactions that become possible, this trust also shapes how users feel about, and act on, the social and community values that they hold with their co-users. We draw implications for future payment systems that make use of community connections, build trust, leverage transactional latency, and generate opportunities for rich social interactions.",
        "keywords": "",
        "authors": [
            {
                "name": "Jennifer Ferreira"
            },
            {
                "name": "Mark J Perry"
            },
            {
                "name": "Sriram Subramanian"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw466": {
        "title": "Understanding the Roles of Mediators in Social Reinforcement for Health Behavior Change",
        "abstract": "Social reinforcement from other social members is important in maintaining health behavior change. Along with the advancement of persuasive technology and social networking technologies, the place where social interaction occur has been expanded. While social media users become potential mediators for social reinforcement, little work exists on what roles the mediators have in social reinforcement and how differently the mediators motivate and affect to maintain health behavior change of users. To investigate this, we conducted interviews with 13 participants who use a running exercise application for maintaining their health behavior change. Participants were asked to explain their social interaction experience of using the running exercise application, within the application and in social media. This study discovered different effects of three different types of mediators on participants' health behavior maintenance. These findings point to several implications such as successful mediators giving virtual encouragement at an appropriate time in social media.",
        "keywords": "",
        "authors": [
            {
                "name": "Yeoreum Lee"
            },
            {
                "name": "Youn-kyung Lim"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw469": {
        "title": "Circumscribed time and porous time: Logics as a way of studying temporality",
        "abstract": "In this paper, we introduce the notion of a temporal logic to characterize sets of 'organizing principles' that serve to perpetuate a particular orientation to temporality. We identify a dominant temporal logic, circumscribed time, which suggests that time is chunkable, single-purpose, linear, and ownable. We analyze this logic against the everyday temporal experiences of participants in three ethnographic datasets to identify a set of alternative understandings of time, namely that it is also spectral, mosaic, rhythmic, and obligated. We call this initial typology porous time. Our goal in positing porous time as an expansion of circumscribed time is to provoke reflection on how temporal logics underpin the ways that people orient to each other, research and design technologies, and normalize visions of success in contemporary life.  ",
        "keywords": "",
        "authors": [
            {
                "name": "Melissa Mazmanian"
            },
            {
                "name": "Ingrid Erickson"
            },
            {
                "name": "Ellie Harmon"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw474": {
        "title": "Why Replacing Legacy Systems Is So Hard in Global Software Development: An Information Infrastructure Perspective",
        "abstract": "We report on an ethnographic study of an outsourcing global software development (GSD) setup between a Danish IT company and an Indian IT vendor developing a system to replace a legacy system for social services administration in Denmark. Physical distance and GSD collaboration issues tend to be obvious explanations for why GSD tasks fail to reach completion; however, we account for the difficulties within the technical nature of software system task. We use the framework of information infrastructure to show how replacing a legacy system in governmental information infrastructures includes the work of tracing back to knowledge concerning law, technical specifications, as well as how information infrastructures have dynamically evolved over time. Not easily carried out in a GSD setup is the work around technical tasks that requires careful examination of mundane technical aspects, standards, and bureaucratic forms, as well as the excavation work that keeps the information infrastructure afloat.",
        "keywords": "",
        "authors": [
            {
                "name": "Stina Matthiesen"
            },
            {
                "name": "Pernille Bjorn"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw476": {
        "title": "Measuring and Understanding Urban Deprivation from User Generated Content",
        "abstract": "Measuring socioeconomic deprivation of cities in an accurate and timely fashion has become a priority for governments around the world, as the actual massive urbanization process is causing high levels of inequalities which require intervention. Traditionally, deprivation indexes have been derived from census data, which is however expensive, and thus acquired only every few years. Furthermore, data is not amenable to easy interpretation. To remedy this, we propose a method to mine deprivation at a fine spatio-temporal granularity, that only requires access to freely available user-generated content, and that affords easy interpretation by administrators and citizens alike. More precisely, the method needs access to datasets (e.g., Foursquare, OpenStreetMap) describing what urban elements are present in the physical environment. Using these datasets, we quantitatively describe neighborhoods for three UK urban areas through a metric, Offering Advantage. We demonstrate that we can extract strong signals of deprivation from those datasets, and build accurate classifiers of deprivation. Using thematic analysis, we show that such signals afford easy interpretation. ",
        "keywords": "",
        "authors": [
            {
                "name": "Alessandro Venerandi"
            },
            {
                "name": "Giovanni Quattrone"
            },
            {
                "name": "Licia Capra"
            },
            {
                "name": "Daniele Quercia"
            },
            {
                "name": "Diego Saez-Trumper"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw481": {
        "title": "Understanding Copyright in Online Creative Communities",
        "abstract": "Copyright law is increasingly relevant to everyday interactions online, from social media status updates to artists showcasing their work. This is especially true in creative spaces where rules about reuse and remix are notoriously gray. Based on a content analysis of public forum postings in eight different online communities featuring different media types (music, video, art, and writing), we found that copyright is a frequent topic of conversation and that much of this discourse stems from problems that copyright causes for creative activities. We identify the major types of problems encountered, including chilling effects that negatively impact technology use. We find that many challenges can be explained by lack of knowledge about legal or policy rules, including breakdowns in user expectations for the sites they use. We argue that lack of clarity is a pervasive usability problem that should be considered more carefully in the design of user-generated content platforms.",
        "keywords": "",
        "authors": [
            {
                "name": "Casey Fiesler"
            },
            {
                "name": "Jessica L Feuston"
            },
            {
                "name": "Amy S Bruckman"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 1,
        "bestPaperNominee": 0
    },
    "cscw483": {
        "title": "There's No Such Thing as the Perfect Map: Quantifying Bias in Spatial Crowd-sourcing Datasets",
        "abstract": "Crowd-sourcing has become a popular form of computer mediated collaborative work and OpenStreetMap represents one of the most successful crowd-sourcing systems, where the goal of building and maintaining an accurate global map of the world is being accomplished by means of contributions made by over 1.2M citizens. However, within this apparently large crowd, a tiny group of highly active users is responsible for the mapping of almost all the content. One may thus wonder to what extent the information being mapped is biased towards the interests and agenda of this group of users. In this paper, we present a method to quantitatively measure bias in crowd-sourced geographic information. We quantify bias across a three-year period of OpenStreetMap mapping in 22 countries. We find almost no bias in terms of what is being mapped, but significant geographic bias; furthermore, we find that bias in terms of meticulousness varies with culture. ",
        "keywords": "",
        "authors": [
            {
                "name": "Giovanni Quattrone"
            },
            {
                "name": "Licia Capra"
            },
            {
                "name": "Pasquale De Meo"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw488": {
        "title": "Computer Support for Financial Advisors and Their Clients: Co-creating an Investment Plan",
        "abstract": "This paper investigates how financial advisors use their computer systems in advisory meetings with clients, with special focus on the collaborative decision-making. Results from observations and interviews form the base for discussions of future design efforts. The financial advisors in the study were not much helped by their computer system in visualizing and explaining financial concepts to their clients, and not all of them trusted the system's decision support feature. Furthermore, client meetings can involve more than one client, which has further implications for the design of decision support.",
        "keywords": "",
        "authors": [
            {
                "name": "Susanna Heyman"
            },
            {
                "name": "Henrik Artman"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw497": {
        "title": "Predicting a Community's Flu Dynamics with Mobile Phone Data",
        "abstract": "Human interactions sensed ubiquitously by cellphones can benefit many domains, particularly for monitoring the spread of disease. We consider various network configurations for integrating real interaction data into a standard epidemic model to model the diffusion of influenza. We present two ways of simulating such dynamics on the interactions of a community over a period of 17 weeks.  Our focus is to determine the accuracy of incorporating interaction data into dynamic models for infection prediction. The dataset considered contains the actual flu symptoms of participants over the 17 week period, providing a concrete source for evaluation. Given the real participant flu cases obtained by surveys simultaneous to the mobile phone data collection, we find obtain errors of less than 2 infected people on average (when predicting the number of infected people over time considering a population of 72 people) and precisions of approximately 30% (when predicting exactly which individual was infected at a given time).",
        "keywords": "",
        "authors": [
            {
                "name": "Katayoun Farrahi"
            },
            {
                "name": "Remi Emonet"
            },
            {
                "name": "Manuel Cebrian"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw505": {
        "title": "'Is' to 'Was': Coordination and Commemoration in Posthumous Activity on Wikipedia Biographies",
        "abstract": "Following the deaths of notable people, Wikipedians incorporate this new knowledge by updating or creating biographical articles. Drawing on literature from death studies and peer production, we demonstrate how the creation of these \"wiki-bituaries\" requires complex coordination work and highlight processes of commemoration and memorialization within socio-technical systems. Using the corpus of 6,132 articles about people who died in 2012, we examine the network relationships and contribution dynamics of users who perform this work and identify behavioral and content dynamics on the biographical articles about the deceased. The collaborations that emerge from posthumous editing of these biographies are sites of significant activity that coalesce into complex but temporary collaborations. Based on these findings, we argue that Wikipedia has re-imagined the obituary into a genre for creating memory spaces in which the death of a subject prompts a form of \"death work\" involving the collective re-evaluation of article content and a transition into a new mode of data stewardship.",
        "keywords": "",
        "authors": [
            {
                "name": "Brian C Keegan"
            },
            {
                "name": "Jed R Brubaker"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw506": {
        "title": "Toward Collaborative Ideation at Scale -- Leveraging Ideas from Others to Generate More Creative and Diverse Ideas",
        "abstract": "A growing number of large collaborative idea generation platforms promise that by ideating together, people can create better ideas than any would have alone. But how might these platforms support collaboration beyond just aggregation?  Prior research suggests that seeing particularly creative or diverse ideas from others can inspire you, but few scalable mechanisms exist to assess diversity. We contribute a new scalable crowd-powered method for evaluating the diversity of sets of ideas.  The method relies on similarity comparisons (is idea A more similar to B or C?) generated by non-experts to create an abstract spatial idea map. Our validation study reveals that human raters agree with the estimates of dissimilarity derived from our idea map as much or more than they agree with each other. People seeing the diverse sets of examples from our idea map  generate more diverse ideas than those seeing randomly selected examples. We see this work as a step toward building more effective online systems for supporting large scale collective ideation.",
        "keywords": "",
        "authors": [
            {
                "name": "Pao Siangliulue"
            },
            {
                "name": "Kenneth C Arnold"
            },
            {
                "name": "Krzysztof Z Gajos"
            },
            {
                "name": "Steven P Dow"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw508": {
        "title": "Towards an Appropriable CSCW Tool Ecology: Lessons from the Greatest International Scavenger Hunt the World Has Ever Seen",
        "abstract": "If you could accomplish a complex, collaborative work task with one tool or many tools working together, which would you choose?  In this paper, we present a case study of GISHWHES (the \"Greatest International Scavenger Hunt the World Has Ever Seen\"), an annual event in which teams spend one week completing complex, creative tasks. Building on the literature of IT ecosystems, we show how teams used different collections of tools to meet their communication needs. We interviewed team members, finding that most teams used multiple tools during GISHWHES.  By analyzing which tools they chose over others for each function, we gain insight into the strengths and weaknesses of these tools, and the complexity surrounding work processes. In light of this complexity, this research highlights the importance of designing appropriable tools that can work with unanticipated workflows and mesh well with other tools in a communicative ecology.",
        "keywords": "",
        "authors": [
            {
                "name": "Joseph A Gonzales"
            },
            {
                "name": "Casey Fiesler"
            },
            {
                "name": "Amy S Bruckman"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw516": {
        "title": "The Success and Failure of Quality Improvement Projects in Peer Production Communities",
        "abstract": "Peer production communities have been proven to be successful at creating valuable artefacts, with Wikipedia a prime example. However, a number of studies have shown that their work tends to be of uneven quality, with certain content areas receiving more attention than others. In this paper, we examine the efficacy of a range of targeted strategies to increase the quality of under-attended content areas in peer production communities. Mining data from five such quality improvement projects in the English Wikipedia, the largest peer production community in the world, we show that certain types of strategies (e.g. creating artefacts from scratch) have better quality outcomes than others (e.g. improving existing artefacts), even if both are done by a similar cohort of participants. We discuss the implications of our findings for Wikipedia as well as other peer production communities.",
        "keywords": "",
        "authors": [
            {
                "name": "Morten Warncke-Wang"
            },
            {
                "name": "Vladislav R Ayukaev"
            },
            {
                "name": "Brent Hecht"
            },
            {
                "name": "Loren G Terveen"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw518": {
        "title": "What to Expect When the Unexpected Happens: Social Media Communications Across Crises",
        "abstract": "The use of social media to communicate timely information during crisis situations has become a common practice in recent years. In particular, the one-to-many nature of Twitter has created an opportunity for stakeholders to disseminate crisis-relevant messages, and to access vast amounts of information they may not otherwise have. Our goal is to understand what affected populations, response agencies and other stakeholders can expect -- and not expect -- from this data in various types of disaster situations. Anecdotal evidence suggests that different types of crises elicit different reactions from Twitter users, but we have yet to see whether this is in fact the case. In this paper, we investigate several crises in a systematic manner and with a consistent methodology. This leads to insights about the prevalence of different information types and sources across a variety of crisis situations, including natural hazards and human-induced disasters.",
        "keywords": "",
        "authors": [
            {
                "name": "Alexandra Olteanu"
            },
            {
                "name": "Sarah Vieweg"
            },
            {
                "name": "Carlos Castillo"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw523": {
        "title": "Collaboration in-between: The Care Hotel and Designing for Flexible Use",
        "abstract": "In this paper, we analyze challenges of working in-between organizations and established information infrastructures. The Care Hotel is a municipal healthcare facility where persons, typically after a hospital stay, undergo rehabilitation so they may live independently at home. Admission, stay, and discharge from the Care Hotel entail numerous coordination activities with both frequent and sporadic heterogeneous external collaborators: General practitioners, relatives, hospitals, etc., some of which are already part of large information infrastructures, while others are too small or shifting to allow for stable arrangements. Hence, work at the Care Hotel can be characterized as 'collaboration in-between'. We propose a design solution for flexible use to spur reflections on the design implications and how to meet the challenges of collaboration in-between. Large infrastructures continue to develop and we posit that challenges of collaboration in-between will also become relevant other settings outside the Care Hotel. Also, the case may be relevant to health care providers in contexts of fragmented healthcare, since they face similar challenges.",
        "keywords": "",
        "authors": [
            {
                "name": "Erik Grönvall"
            },
            {
                "name": "Claus Bossen"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw527": {
        "title": "NUGU: A Group-based Intervention App for Improving Self-Regulation of Limiting Smartphone Use",
        "abstract": "Our preliminary study reveals that individuals use various coping strategies for limiting smartphone use, ranging from keeping smartphones out of reach to removing apps. However, we also found that users often had difficulties in maintaining their chosen coping strategies due to lack of self-regulation. In this paper, we present NUGU, a group-based intervention app for improving self-regulation of limiting smartphone usage by leveraging social support: groups of people limit their use together by sharing their limiting information. NUGU is designed based on the social cognitive theory and has been developed iteratively through two pilot tests. Our three-week user study (n = 62) demonstrated that compared with the non-social counterpart, the NUGU users' usage amount significantly decreased and their perceived level of managing disturbances improved significantly. Furthermore, our exit interview results confirmed that NUGU's design elements are effective for achieving limiting goals.",
        "keywords": "",
        "authors": [
            {
                "name": "Minsam Ko"
            },
            {
                "name": "Subin Yang"
            },
            {
                "name": "Joonwon Lee"
            },
            {
                "name": "Christian Heizmann"
            },
            {
                "name": "Jinyoung Jeong"
            },
            {
                "name": "Uichin Lee"
            },
            {
                "name": "DAE HEE SHIN"
            },
            {
                "name": "Koji Yatani"
            },
            {
                "name": "Junehwa Song"
            },
            {
                "name": "KM Chung"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw530": {
        "title": "Massive  Open Online Proctor: protecting the credibility of MOOCs certificates",
        "abstract": "Massive Open Online Courses (MOOCs) enable everyone to receive high-quality education. However, current MOOC creators cannot provide an effective, economical, and scalable method to detect cheating on test, which would be required for any certification. In this paper, we propose a Massive Open Online Proctoring (MOOP) framework, which combines both automatic and collaborative approaches to detect cheating behaviors in online tests. The MOOP framework consists of three major components: Automatic Cheating Detector (ACD), Peer Cheating Detector (PCD), and Final Review Committee (FRC). ACD uses webcam video or other sensors to monitor students and automatically flag suspected cheating behavior. Ambiguous cases are then sent to the PCD, where students peer-review flagged webcam video to confirm suspicious cheating behaviors. Finally, the list of suspicious cheating behaviors is sent to the FCD to make the final punishing decision. Our experiment show that ACD and PCD can detect usage a cheat sheet with good accuracy and can reduce the overall human resources required to monitor MOOCs for cheating.",
        "keywords": "",
        "authors": [
            {
                "name": "Xuanchong Li"
            },
            {
                "name": "Kai-min Chang"
            },
            {
                "name": "Yueran Yuan"
            },
            {
                "name": "Alexander Hauptmann"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw531": {
        "title": "Conducting Large-Scale Online Experiments With Uncompensated Samples",
        "abstract": "Web-based experimentation with uncompensated samples has the potential to support the generation, replication, verification, and extension of results with larger and more diverse sample populations than previously seen. We introduce the experimental online platform OnlineLab, which provides participants with personalized feedback in exchange for participation in behavioral studies. In comparison to conventional in-lab studies, OnlineLab enables the recruitment of participants at larger scale and from more diverse demographic and geographic backgrounds. We employ Google Analytics data, participants' comments, and tweets to discuss how participants hear about the platform, and why they might choose to participate. Analyzing three example experiments, we additionally show that these experiments replicate previous in-lab study results with comparable data quality. ",
        "keywords": "",
        "authors": [
            {
                "name": "Katharina Reinecke"
            },
            {
                "name": "Krzysztof Z Gajos"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw544": {
        "title": "CURIOS: Connecting Community Heritage through Linked Data",
        "abstract": "The CURIOS project explores how digital archives for rural community heritage groups can be made more sustainable so that volunteer members can maintain a lasting digital presence. It is developing software tools to help remote rural communities to collaboratively maintain and present information about their cultural heritage. The objective is to investigate the use of semantic web/linked data technology to build a general, flexible and \"future proof\" software platform that could help such projects to develop digital archives and to be sustainable over time. As an interdisciplinary project we aim to synthesise a narrative that draws from both social science and computer science perspectives by critically reflecting upon the novel approach taken and the on-going results that are being produced.",
        "keywords": "",
        "authors": [
            {
                "name": "Gemma Webster"
            },
            {
                "name": "David E Beel"
            },
            {
                "name": "Hai Nguyen"
            },
            {
                "name": "Chris Mellish"
            },
            {
                "name": "Claire Wallace"
            },
            {
                "name": "Jeff Pan"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw554": {
        "title": "Individual and Social Recognition: Challenges and Opportunities in Migraine Management",
        "abstract": "This study investigates how people manage chronic migraine -- an illness characterized by unpredictable, intermittent breakouts in everyday life. Participants in our study must self-identify migraine symptoms, triggers, and effective coping mechanisms while also seeking social recognition and assistance from a social network during migraine attacks. We argue that the challenges in identifying and managing migraine as well as in communicating with clinicians and social networks arise in response to the patients' need to deal with the unpredictability and intermittency of the disease. We suggest technologies that, unlike current chronic care systems, enable patients with migraine and similar diseases to track a wide range of life events across intermittent time stamps and help make sense of subjective information. We argue that technologies should also help patients gain social recognition and assistance during breakouts. This work contributes to the growing body of knowledge in personal informatics and quantified-self research.",
        "keywords": "",
        "authors": [
            {
                "name": "Sun Young Park"
            },
            {
                "name": "Yunan Chen"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw557": {
        "title": "Social Eye Tracking: Gaze Recall with Online Crowds",
        "abstract": "Eye tracking is a compelling tool for revealing people's spatial-temporal distribution of visual attention. But quality eye tracking hardware is expensive and can only be used with one person at a time.  Further, webcam eye tracking systems have significant limitations on head movement and lighting conditions that result in significant data loss and inaccuracies. To address these drawbacks, we introduce a new approach that harnesses the crowd to understand allocation of visual attention. In our approach, crowdsourcing participants use mouse clicks to self-report the positions and trajectory for the following valuable eye tracking measures: first gaze, last gaze and all gazes. We validate our crowdsourcing approach with a user study, which demonstrated good accuracy when compared to a real eye tracker. We then deployed our prototype, GazeCrowd, in a crowdsourcing setting, and showed that it accurately generated gaze heatmaps and trajectory maps. Such an approach will allow designers to evaluate and refine their visual design without requiring the use of limited/expensive eye trackers.",
        "keywords": "",
        "authors": [
            {
                "name": "Shiwei Cheng"
            },
            {
                "name": "Zhiqiang Sun"
            },
            {
                "name": "Xiaojuan Ma"
            },
            {
                "name": "Jodi L Forlizzi"
            },
            {
                "name": "Scott E Hudson"
            },
            {
                "name": "Anind Dey"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw558": {
        "title": "The Effects of Visualizing Activity History on Attitudes and Behaviors in a Peer Production Context",
        "abstract": "In a variety of peer production settings, from Wikipedia to open source software development to crowdsourcing, individuals may encounter, edit, or review the work of unknown others.  Typically this is done without much context to the person's past behavior or performance.  To understand how exposure to an unknown individual's activity history influences attitudes and behaviors, we conducted an online experiment on Mechanical Turk varying the content, quality, and presentation of information about another Turker's work history.  Surprisingly, negative work history did not lead to negative outcomes, but in contrast, a positive work history led to positive initial impressions that persisted in the face of contrary information.  This work provides insight into the impact of activity history design factors on psychological and behavioral outcomes that can be of use in other related settings.",
        "keywords": "",
        "authors": [
            {
                "name": "Jennifer Marlow"
            },
            {
                "name": "Laura A Dabbish"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw560": {
        "title": "Structuring Interactions for Large-Scale Synchronous Peer Learning",
        "abstract": "This research investigates how to introduce synchronous interactive peer learning into an online setting appropriate both for crowdworkers (learning new tasks) and students in massive online courses (learning course material). We present an interaction framework in which groups of learners are formed on demand and then proceed through a sequence of activities that include synchronous group discussion on learner-generated responses.  Via controlled experiments with crowdworkers, we show that  discussing challenging problems leads to better outcomes than working individually, and incentivizing people to help one another yields still better results.   We then show that providing  a mini-lesson in which workers consider the principles underlying the tested concept and justify their answers leads to further improvements.  Combining the mini-lesson with the discussion of the multiple-choice question leads to significant improvements on that question. We also find positive subjective responses to the peer interactions, suggesting that discussions can improve morale in remote work or learning settings. ",
        "keywords": "",
        "authors": [
            {
                "name": "Derrick Coetzee"
            },
            {
                "name": "Seongtaek Lim"
            },
            {
                "name": "Armando Fox"
            },
            {
                "name": "Bjoern Hartmann"
            },
            {
                "name": "Marti Hearst"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw563": {
        "title": "Comparing Health Information Sharing Preferences of Cancer Patients, Doctors, and Navigators",
        "abstract": "As technologies such as personal health records and symptom trackers become more common, we are beginning to see an increase in patients actively engaging in health tracking behaviors. Patient collected data can provide valuable insight for healthcare providers, particularly in the area of breast cancer. Thus far, little work has examined whether the health information that patients are willing to track and share aligns with the health information needs of healthcare providers. Our work provides a comparison between the health information sharing preferences between breast cancer patients, doctors and navigators. We identify discrepancies between stakeholders' preferences, signifying where technology can play an important role in helping patients prioritize the health information that is shared with providers. We also present design implications from this work to guide the development of future health information sharing tools that consider the differing needs of those within a healthcare network.",
        "keywords": "",
        "authors": [
            {
                "name": "Maia L Jacobs"
            },
            {
                "name": "James Clawson"
            },
            {
                "name": "Elizabeth D Mynatt"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw564": {
        "title": "The Perverse Effects of Social Transparency  on Online Advice Taking",
        "abstract": "Increasingly, the advice people receive on the Internet is socially transparent in the sense that it displays contextual information about the advice-giver or his actions. We hypothesize that activity transparency -- seeing an advice giver's process while creating his recommendations -- will increase advice taking. We report three experiments testing the effect of activity transparency on taking mediocre advice. We found that the presence of a web history increased the likelihood of following a financial advisor's advice and reduced participant earnings (Exp. 1), especially when the web history implied greater task focus (Exp. 2, 3). CSCW research usually emphasizes how to increase information sharing; this work suggests when shared information may be inappropriate. We suggest ways to counter activity transparency's potential downsides.",
        "keywords": "",
        "authors": [
            {
                "name": "Duyen T Nguyen"
            },
            {
                "name": "Laura A Dabbish"
            },
            {
                "name": "Sara Kiesler"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw574": {
        "title": "Mudslinging and Manners: Unpacking conflict in Free and Open Source Software",
        "abstract": "As the nature of virtual work changes, so must our understanding of important processes such as conflict. The present study examines conflict in ongoing virtual teams by situating itself in the context of Free and Open Source Software (FOSS) development. A series of semi-structured interviews with diverse representatives of the FOSS community highlight differences in the way conflict occurs. Specifically, a transformation of conflict types is observed together with a form of conflict previously unidentified in work on virtual teams. Findings suggest that the changing structure of ongoing virtual teams has important consequences for team processes like conflict. ",
        "keywords": "",
        "authors": [
            {
                "name": "Anna Filippova"
            },
            {
                "name": "Hichang Cho"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw582": {
        "title": "Motivating Multi-Generational Crowd Workers in Social-Purpose Work",
        "abstract": "Crowdsourcing for social goals (e.g., supporting people with disabilities and public libraries) is a promising area. However, it is little known about how to develop active worker communities for such a goal. First, metrics of motivation for workers in this area are not yet established. Second, the characteristics of senior crowd workers have rarely been studied, even though they often play a primary role in social-purpose work. This work introduces a four-quadrant worker motivation model for social-purpose crowdsourcing and designs a system based on the model. Then we investigate the outcomes from the system running for six months, which involved both young and senior workers, to find better ways to make an active community of crowd workers. We analyze worker activities based on the system logs, conducted a questionnaire-based survey, assess the correlations between the subjective values and actual behaviors, and discuss the implications.",
        "keywords": "",
        "authors": [
            {
                "name": "Masatomo Kobayashi"
            },
            {
                "name": "Shoma Arita"
            },
            {
                "name": "Toshinari Itoko"
            },
            {
                "name": "Shin Saito"
            },
            {
                "name": "Hironobu Takagi"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw585": {
        "title": "Give Social Network Users the Privacy They Want",
        "abstract": "Social Network Site (SNS) privacy is often characterized as a trade-off where users must give up privacy to gain social benefits. We investigate the alternative viewpoint that SNS users gain the most benefits when SNSs give them the privacy they desire. Applying structural equation modeling to survey data of 303 Facebook users, we examine the complex relationship between privacy and SNS outcomes. We found that SNS users whose privacy desires (whether high or low) were met reported higher levels of Social Connectedness than users who achieved less privacy than they desired. Social Connectedness, in turn, played a pivotal role in building Social Capital. Additionally, we found that this positive effect of \"Privacy Fit\" was stronger for casual users than for avid users, and that Privacy Fit was associated with higher levels of Facebook Use. These findings suggest that more openness may not always be better; SNSs should aim to meet users' privacy needs to enhance the user experience and ensure the sustained use of SNS.",
        "keywords": "",
        "authors": [
            {
                "name": "Pamela J Wisniewski"
            },
            {
                "name": "A.K.M. Najmul Islam"
            },
            {
                "name": "Bart P Knijnenburg"
            },
            {
                "name": "Sameer Patil"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw587": {
        "title": "Functional Roles within Wikipedia: Organizational Structure and Career Paths",
        "abstract": "Participants in peer production efforts can take on different roles. Recent studies established that the organization of online production communities is not flat; rather, functional roles are well-defined and organized. What is the nature of these functional roles? How have they evolved? And how do participants' career paths traverse these functions? Prior studies focused primarily on participants' activities -- rather than functional roles -- and those investigating functions focused on administrators. Further, extant conceptualizations of role transitions in production communities, such as the Reader to Leader framework, emphasize a single dimension, of hierarchical power, overlooking distinctions between functions. In this work we empirically study functional organization within Wikipedia, seeking to validate existing theoretical frameworks. The analysis sheds new light on the nature of functional roles, revealing the intricate \"career paths\" resulting from participants' role transitions. Our results call into focus the essential, yet under-investigated, mid-level layer of functional roles within Wikipedia. ",
        "keywords": "",
        "authors": [
            {
                "name": "Ofer Arazy"
            },
            {
                "name": "Felipe Ortega"
            },
            {
                "name": "Lisa Yeo"
            },
            {
                "name": "Adam Balila"
            },
            {
                "name": "Oded Nov"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw588": {
        "title": "Collective Intelligence or Group Think? Engaging Participation Patterns in World without Oil",
        "abstract": "This article presents an analysis of participation patterns in an Alternate Reality Game, World Without Oil. This game aims to bring people together in an online environment to reflect on how an oil crisis might affect their lives and communities as a way to both counter such a crisis and to build collective intelligence about responding to it. We present a series of participation profiles based on a quantitative analysis of 1554 contributions to the game narrative made by 331 players. We further qualitatively analyze a sample of these contributions. We outline the dominant themes, the majority of which engage the global oil crisis for its effects on commute options and present micro-sustainability solutions in response. We further draw on the quantitative and qualitative analysis of this space to discuss how the design of the game, specifically its framing of the problem, feedback mechanism, and absence of subject-matter expertise, counter its aim of generating collective intelligence, making it conducive to groupthink.",
        "keywords": "",
        "authors": [
            {
                "name": "Nassim JafariNaimi"
            },
            {
                "name": "Eric M Meyers"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw590": {
        "title": "Role of Online Health Communities on Clinical Questions Learned from \"See your doctor\" Threads",
        "abstract": "Online health communities are known to provide psychosocial support. However, concerns for misinformation being shared around clinical information persist. An existing practice addressing this concern includes monitoring and, as needed, discouraging asking clinical questions in the community. In this paper, we examine such practice where moderators redirected patients to see their health care providers instead of consulting the community. We observed that, contrary to common beliefs, community members provided constructive tips and persuaded the patients to see doctors rather than attempting to make a diagnosis or give medical advice. Moderators' posts on redirecting patients to see their providers were highly associated with no more follow up replies, potentially hindering active community dynamic. Our findings showed what is previously thought of as a solution -- quality control through moderation -- might not be best and that the community, in coordination with moderators, can provide critical help in addressing clinical questions and building constructive information sharing community environment.",
        "keywords": "",
        "authors": [
            {
                "name": "Jina Huh"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw593": {
        "title": "And Now for Something Completely Different: Improving Crowdsourcing Workflows with Micro-Diversions",
        "abstract": "Crowdsourcing has become a popular and indispensable component of many problem-solving pipelines in the research literature, with crowd workers often treated as computational resources that can reliably solve problems that computers have trouble with, such as image labeling/classification, natural language processing, or document writing. Yet, obviously crowd workers are human, and long sequences of the same monotonous tasks might intuitively reduce the amount of good quality work done. Here we propose an investigation into how we can use diversions containing small amounts of entertainment to improve crowd workers' experiences.  We call these small period of entertainment \"micro-diversions\", which we hypothesize to provide timely relief to workers during long sequences of micro-tasks.  We hope to improve productivity by retaining workers to work on our tasks longer and to either improve or retain the same quality of work.  We experimentally test micro-diversions on Amazon Mechanical Turk, a large paid-crowdsourcing platform. We find that micro-diversions can significantly improve worker retention rate while retaining the same work quality.",
        "keywords": "",
        "authors": [
            {
                "name": "Peng Dai"
            },
            {
                "name": "Jeffrey M Rzeszotarski"
            },
            {
                "name": "Praveen Paritosh"
            },
            {
                "name": "Ed H Chi"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw596": {
        "title": "\"I LOVE THIS SITE!\" vs. \"It's a little girly\": Perceptions of and Initial User Experience with Pinterest",
        "abstract": "Pinterest is a popular social networking site that lets people discover, collect, and share pictures of items from the Web. Among popular social media sites, Pinterest has by far the most skewed gender distribution: women are four times more likely than men to use it. To better understand this, we examined two factors that generally affect whether people try a social site and whether they continue using it: the external perception of a site (e.g., as conveyed in popular media) and the site's initial user experience. For the latter, we focused on the role of social bootstrapping, importing contacts from one social site to another. We conducted a survey study, finding that: perceptions of Pinterest among users and non-users of the site differed significantly; trying Pinterest led to substantial changes in user perceptions of the site; social bootstrapping affected users' initial impression of Pinterest, generally improving it for women and harming it for men. We present implications of our findings for design and research.",
        "keywords": "",
        "authors": [
            {
                "name": "Hannah J Miller"
            },
            {
                "name": "Shuo Chang"
            },
            {
                "name": "Loren G Terveen"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw597": {
        "title": "Creating Value Together: The Emerging Design Space of Peer-to-Peer Currency and Exchange",
        "abstract": "Paradigms for the collaborative creation of value through trade and exchange have developed over millennia. Thus, coins emerged in response to a set of challenges in barter and gift exchange. The development of paradigms for trade and exchange continues today, and is accelerating due both to crises in the mainstream global economy, and to new possibilities enabled by information technology. In this discussion paper, we consider alternative and complementary currency and exchange innovations, including local/community currencies, timebanks, crypto-currencies, and person-to-person collaborative economy micro-enterprises, as a technology design space for currency and exchange. We consider the consequences and trajectories of the rapidly evolving currency ecosystem, particularly with respect to research and development opportunities for CSCW.",
        "keywords": "",
        "authors": [
            {
                "name": "John M Carroll"
            },
            {
                "name": "Victoria M Bellotti"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw599": {
        "title": "Coming of Age (Digitally): An Ecological View of Social Media Use among College Students",
        "abstract": "We take an ecological approach to studying social media use and its relation to mood among college students. We conducted a mixed-methods study of computer and phone logging with daily surveys and interviews to track college students' use of social media during all waking hours over seven days. Continual and infrequent checkers show different preferences of social media sites. Age differences also were found. Lower classmen tend to be heavier users and to primarily use Facebook, while upper classmen use social media less frequently and utilize sites other than Facebook more often. Factor analysis reveals that social media use clusters into patterns of content-sharing, text-based entertainment/discussion, relationships, and video consumption. The more constantly one checks social media daily, the less positive is one's mood. Our results suggest that students construct their own patterns of social media usage to meet their changing needs in their environment. The findings can inform further investigation into social media use as a benefit and/or distraction for students.",
        "keywords": "",
        "authors": [
            {
                "name": "Yiran Wang"
            },
            {
                "name": "Melissa Niiya"
            },
            {
                "name": "Gloria Mark"
            },
            {
                "name": "Stephanie M Reich"
            },
            {
                "name": "Mark Warschauer"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw603": {
        "title": "Procid: Bridging Consensus Building Theory with the Practice of Distributed Design Discussions",
        "abstract": "Consensus is a desired but elusive goal in many distributed discussions. A critical problem is that discussion platforms lack specific mechanisms for realizing consensus strategies and realizing some strategies without tool support is hard. This paper introduces Procid, a novel browser plugin that provides interaction and visualization features for bringing consensus strategies to distributed design discussions. Key features include the ability to organize discussions around ideas, register and make others aware of strong support for or against ideas, and define criteria for evaluating ideas. It also applies interaction constraints promoting best practices of consensus. Procid extends the discussion platform of one open source software community. Two evaluations were conducted. The first collected perceptions of the tool from members of the community. The second compared how Procid affects a distributed design discussion relative to the current platform in the community. Results of both studies supported our design goals and showed that users perceived our tool as more effective for consensus building than the existing platform.",
        "keywords": "",
        "authors": [
            {
                "name": "Roshanak Zilouchian Moghaddam"
            },
            {
                "name": "Brian P Bailey"
            },
            {
                "name": "Zane Nicholson"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw626": {
        "title": "Strategic Voting Behavior in Doodle Polls",
        "abstract": "Finding a common time slot for a group event is a daily conundrum and illustrates key features of group decision-making. It is a complex interplay of individual incentives and group dynamics. We combine large-scale data analysis with theoretical models from voting literature to investigate strategic behaviors in event-scheduling.  We analyze all the Doodle polls created in the US from July-September 2011 (over 340,000 polls), consisting of both hidden polls (where you cannot see other people's votes) and open polls (where you can see all the previous responses). By analyzing the differences in behavior in hidden and open polls, we gain insights into strategies that people apply in natural voting settings. Responders in open polls are more likely to approve slots that are very popular or very unpopular, but not intermediate slots. We show that this behavior is inconsistent with models that have been proposed in the voting literature, and propose a new model based on combining personal and social utilities to explain the data.  ",
        "keywords": "",
        "authors": [
            {
                "name": "James Zou"
            },
            {
                "name": "Reshef Meir"
            },
            {
                "name": "David Parkes"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw627": {
        "title": "Monetizing Network Hospitality: Hospitality and Sociability in the Context of Airbnb",
        "abstract": "We present a qualitative study of hospitality exchange processes that take place via the online peer-to-peer platform Airbnb. We explore 1) what motivates individuals to monetize network hospitality and 2) how the presence of money ties in with the social interaction related to network hospitality. We approach the topic from the perspective of hosts -- that is, Airbnb users who participate by offering accommodation for other members in exchange for monetary compensation. We found that participants were motivated to monetize network hospitality for both financial and social reasons. Our analysis indicates that the presence of money can provide a helpful frame for network hospitality, supporting hosts in their efforts to accomplish desired sociability, select guests consistent with their preferences, and control the volume and type of demand. We conclude the paper with a critical discussion of the implications of our findings for network hospitality and, more broadly, for the so-called sharing economy.",
        "keywords": "",
        "authors": [
            {
                "name": "Tapio I Ikkala"
            },
            {
                "name": "Tapio I Ikkala"
            },
            {
                "name": "Airi M Lampinen"
            },
            {
                "name": "Airi M Lampinen"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw630": {
        "title": "Understanding Online Reviews: Funny, Cool or Useful?",
        "abstract": "Increasingly online reviews are relied upon to make choices about the  purchases and services we use daily. In order for an online review community  to be effective to both users and businesses, it is important to  understand what constitutes a high quality review as perceived by  people, and how to maximize quality of reviews in the community. In  this paper, we study Yelp to answer these questions. We analyze about  230,000 reviews and member interaction (votes) with these  reviews. We find that active and regular members are the highest  contributors to good quality reviews and longer reviews have higher  chances of being popular in the community. We find that reviews voted  useful tend to be the early ones reviews for a specific  business. Our findings have implications on enabling high quality  member contributions and community effectiveness.  We discuss the  implications to design of social systems with diverse feedback  signals.",
        "keywords": "",
        "authors": [
            {
                "name": "Saeideh Bakhshi"
            },
            {
                "name": "Partha Kanuparthy"
            },
            {
                "name": "David A Shamma"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw633": {
        "title": "Transition and Reflection in the Use of Health Information: The Case of Pediatric Bone Marrow Transplant Caregivers",
        "abstract": "The impact of health information on caregivers is of increasing interest in order to design systems that support the social and emotional dimensions of managing health. Drawing on an interview study, as well as a multi-year ethnography, we detail the practices of caregivers in a bone marrow transplant  center. We examine the interconnections between information and emotional work performed by caregivers through a liminal lens, highlighting the BMT experience as a time of transition and reflection in which caregivers must quickly adapt to the new social world of the hospital  and manage a wide range of patient needs. The transition from parent to \"caregiver\" is challenging, placing additional emotional burdens on the intensive information work for managing BMT. As a time of reflection, the BMT experience also provides an occasion for generative thinking and alternative approaches to health management. Our study findings call for health systems that reflect a design paradigm focused on 'transforming lives' rather than 'transferring information.'",
        "keywords": "",
        "authors": [
            {
                "name": "Elizabeth Kaziunas"
            },
            {
                "name": "Ayse G Buyuktur"
            },
            {
                "name": "Jasmine Jones"
            },
            {
                "name": "Sung W Choi"
            },
            {
                "name": "David A Hanauer"
            },
            {
                "name": "Mark S Ackerman"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw634": {
        "title": "Restructuring Human Infrastructure: The impact of EHR deployment in a volunteer-dependent clinic",
        "abstract": "Resource-restricted non-profit organizations (NPOs) are often volunteer-based; their human infrastructure is thus different from conventional organizations. Hence, technologies that work in conventional organizations with a stable workforce may not work in NPOs. Our study revealed a disrupted human infrastructure after an Electronic Health Record (EHR) system implementation in a safety net free clinic that served underprivileged patients. The EHR system failed to support the dynamism of volunteer work essential to the free clinic. Specifically the mismatch between the technological and human infrastructures led to diminished volunteer roles, increased workload of employees, and impacted quality of patient care. In turn, employees initiated to reconcile the disrupted human infrastructure by creating new work roles for volunteers, re-establishing the quality of patient care, and developing workarounds for volunteers to resume their volunteer work. Finally we discuss how the commercial EHR system failed to support the fluid volunteer-based human infrastructure of the free clinic.",
        "keywords": "",
        "authors": [
            {
                "name": "Charlotte Tang"
            },
            {
                "name": "Bryan C Semaan"
            },
            {
                "name": "Yunan Chen"
            },
            {
                "name": "Jahmeilah A Roberson"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw641": {
        "title": "To Risk or Not to Risk? Improving Financial Risk Taking of Older Adults by Online Social Information",
        "abstract": "Managing retirement savings is an increasingly common online activity for older adults. A crucial element of better management is the extent to which financial risk-taking is rational -- whether there is a reasonable balance between expected reward and loss in the face of uncertainty. Social trading networks, utilizing emerging Web 2.0 technologies, has the potential to help individuals manage risk by allowing them to learn from others. It is, however, unclear whether these resources can help older adults to make more rational decisions, especially as older adults are often vulnerable to poor risk management. Devising an experiment that expanded upon an existing experimental economic task, we investigated how older adults' investment decisions are affected by social information. Findings indicate that both peer and majority information help older adults to make more risk-neutral decisions. Further, the more risk-averse an older adult was, the more influential the aggregates of information became. Implications of the online interfaces' designs that harness social information to improve decision-making are discussed.",
        "keywords": "",
        "authors": [
            {
                "name": "Chen Zhao"
            },
            {
                "name": "Wai-Tat Fu"
            },
            {
                "name": "Hanzhe Zhang"
            },
            {
                "name": "Henry Been-Lirn Duh"
            },
            {
                "name": "Shengdong Zhao"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw644": {
        "title": "Avoiding the South Side and the Suburbs: The Geography of Mobile Crowdsourcing Markets",
        "abstract": "Mobile crowdsourcing markets (e.g., Gigwalk, TaskRabbit) offer crowdworkers tasks situated in the physical world. Tasks range from data collection (like checking street signs) to running someone's household errands. Inspired by work demonstrating coverage biases in related domains, we asked two fundamental questions: (1) What factors influence whether a crowdworker will be willing to do a task? (2) What factors influence how much compensation a crowdworker will demand in order to do a task? We carried out a controlled study with mobile crowdworkers in Chicago. Quantitative modeling showed that travel distance to complete a task and the socioeconomic status (SES) of the task area were primary factors. Qualitative analysis enriched our modeling, with workers mentioning safety and access as important factors. More generally, our results show that low SES areas are currently less able to take advantage of mobile crowdsourcing markets.",
        "keywords": "",
        "authors": [
            {
                "name": "Jacob C Thebault-Spieker"
            },
            {
                "name": "Loren G Terveen"
            },
            {
                "name": "Brent Hecht"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw650": {
        "title": "Designing for Temporal Awareness: The Role of Temporality in Time-Critical Medical Teamwork",
        "abstract": "This paper describes the role of temporal information in emergency medical teamwork and how time-based features can be designed to support the temporal awareness of clinicians in this fast-paced and dynamic environment. Engagement in iterative design activities with clinicians over the course of two years revealed a strong need for time-based features and mechanisms, including timestamps for tasks based on absolute time and automatic stopclocks measuring time by counting up since task performance. We describe in detail the aspects of temporal awareness central to clinicians' awareness needs and then provide examples of how we addressed these needs through the design of a shared information display. As an outcome of this process, we define four types of time representation techniques to facilitate the design of time-based features: (1) timestamps based on absolute time, (2) timestamps relative to the process start time, (3) time since task performance, and (4) time until the next required task.",
        "keywords": "",
        "authors": [
            {
                "name": "Diana Kusunoki"
            },
            {
                "name": "Aleksandra Sarcevic"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw652": {
        "title": "Characterizing Online Rumoring Behavior Using Multi-Dimensional Signatures",
        "abstract": "This study offers an in-depth analysis of four rumors that spread through Twitter after the 2013 Boston Marathon Bombings. Through qualitative and visual analysis, we describe each rumor's origins, changes over time, and relationships between different types of rumoring behavior. We identify several quantitative measures -- including temporal progression, domain diversity, lexical diversity and geolocation features -- that constitute a multi-dimensional signature for each rumor, and provide evidence supporting the existence of different rumor types. Ultimately these signatures enhance our understanding of how different kinds of rumors propagate online during crisis events. In constructing these signatures, this research demonstrates and documents an emerging method for deeply and recursively integrating qualitative and quantitative methods for analysis of social media trace data.",
        "keywords": "",
        "authors": [
            {
                "name": "Jim Maddock"
            },
            {
                "name": "Kate Starbird"
            },
            {
                "name": "Haneen J Al-Hassani"
            },
            {
                "name": "Daniel E Sandoval"
            },
            {
                "name": "Mania Orand"
            },
            {
                "name": "Robert M Mason"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw653": {
        "title": "From Awareness to Empowerment: Using Design Fiction to Explore Paths towards a Sustainable Energy Future",
        "abstract": "This paper presents a novel application of participatory design fiction for sustainable domestic energy consumption. In our study we examine the how social practices relate to a newly developed energy management system introduced to households. We explore how design fiction can be used to identify current design limitations and to showcase future design directions to overcome these limitations. In particular, we investigated how energy consumption feedback is leaving users in a state of 'helplessness' despite raising awareness of their environmental impact. Through participatory fictional future story-writing workshops we identified five levels of empowerment that design for sustainability practitioners can engage with. Our proposal is to use those levels of empowerment to reframe sustainable design by shifting from behaviour to social practices and from awareness to empowerment.",
        "keywords": "",
        "authors": [
            {
                "name": "Sebastian Prost"
            },
            {
                "name": "Elke Mattheiss"
            },
            {
                "name": "Manfred Tscheligi"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw654": {
        "title": "Worship, Faith, and Evangelism: Religion as an Ideological Lens for Engineering Worlds",
        "abstract": "While some in the CSCW community have researched the values in technology design and engineering practices, the underlying ideologies that reinforce and protect those val-ues remain under-explored. This paper seeks to address this gap by identifying a common ideological framework that appears across four engineering endeavors: the OLPC Pro-ject, the National Day of Civic Hacking, the Fixit Clinic, and the Stanford d.school. We found that all four of these communities utilized elements of religious practice to af-firm their membership and shared vision. We describe the forms of worship we saw in these engineering worlds, their practices of evangelism, and the ways in which they ad-dressed doubt. We also demonstrate the role mythologies play as ideologically-charged narratives. Our discussion of these parallels illuminates the extent and consequences of quasi-religious practices in engineering worlds and illustrates the utility of using religion as a 'lens' for understanding ideological commitments in engineering culture.",
        "keywords": "",
        "authors": [
            {
                "name": "Morgan G Ames"
            },
            {
                "name": "Daniela K Rosner"
            },
            {
                "name": "Ingrid Erickson"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw658": {
        "title": "Structuring, Aggregating, and Evaluating Crowdsourced Design Critique",
        "abstract": "Feedback is an important component of the design process, but gaining access to high-quality critique outside a classroom or firm is challenging. We present CrowdCrit, a web-based system that allows designers to receive design critiques from non-expert crowd workers. We evaluated CrowdCrit in three studies focusing on the designer's experience and benefits of the critiques. In the first study, we compared crowd (N=14) and expert (N=3) critiques and found evidence that aggregated crowd critique approaches expert critique. In a second study (N=18), we found that designers who got crowd feedback perceived that it improved their design process. The third study (N=14) showed that designers were enthusiastic about crowd critiques and used them to change their designs. We conclude with implications for the design of crowd feedback services.",
        "keywords": "",
        "authors": [
            {
                "name": "Kurt Luther"
            },
            {
                "name": "Jari-lee Tolentino"
            },
            {
                "name": "Wei Wu"
            },
            {
                "name": "Amy K Pavel"
            },
            {
                "name": "Brian P Bailey"
            },
            {
                "name": "Maneesh Agrawala"
            },
            {
                "name": "Bjoern Hartmann"
            },
            {
                "name": "Steven P Dow"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw663": {
        "title": "The Emergence of GitHub as a Collaborative Platform for Education",
        "abstract": "The software development community has embraced GitHub as an essential platform for managing their software projects. GitHub has created efficiencies and helped improve the way software professionals work. It not only provides a traceable project repository, but it acts as a social meeting place for interested parties, supporting communities of practice. Recently, educators have seen the potential in GitHub's collaborative features for managing and improving, perhaps even transforming, the learning experience. In this study, we examine how GitHub is emerging as a collaborative platform for education. We aim to understand how environments such as GitHub, environments that provide social and collaborative features in conjunction with version control, may improve (or possibly hinder) the educational experience for students and teachers. We conduct a qualitative study, focusing on how GitHub is being used in education and the motivations, benefits and challenges it brings.",
        "keywords": "",
        "authors": [
            {
                "name": "Alexey Zagalsky"
            },
            {
                "name": "Joseph E Feliciano"
            },
            {
                "name": "Margaret-Anne Storey"
            },
            {
                "name": "Yiyun Zhao"
            },
            {
                "name": "Weiliang Wang"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw664": {
        "title": "Turkers, Scholars, \"Arafat\" and \"Peace\": Cultural Communities and Algorithmic Gold Standards",
        "abstract": "Crowdsourcing markets like Amazon's Mechanical Turk (AMT) have become the dominant mechanism for building \"gold standard\" datasets in areas ranging from natural language processing to audio transcription. A critical assumption underlies this sea change: crowdsourced markets can accurately replicate the general population's judgments for knowledge-oriented tasks. Focusing on the domain of semantic relatedness algorithms and leveraging Clark's theory of common ground, we demonstrate that this assumption can be highly problematic. Using 7,921 semantic relatedness judgements from 72 scholars and 39 crowdworkers, we show that AMT crowdworkers can produce significantly different gold standard judgements than people from other communities. We show that algorithms performing well against AMT gold standard datasets perform significantly worse when evaluated against other communities' gold standards. Our results call into question the broad use of AMT for the development of gold standards and demonstrate the importance of understanding these datasets from a human-centered point-of-view. More generally, our findings problematize the notion that a universal gold standard dataset exists for all knowledge tasks.",
        "keywords": "",
        "authors": [
            {
                "name": "Shilad W Sen"
            },
            {
                "name": "Matt Lesicko"
            },
            {
                "name": "Margaret E Giesel"
            },
            {
                "name": "Rebecca Gold"
            },
            {
                "name": "Ben Hillmann"
            },
            {
                "name": "Sam Naden"
            },
            {
                "name": "Jesse Russell"
            },
            {
                "name": "Zixiao \"Ken\" Wang"
            },
            {
                "name": "Brent Hecht"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 1,
        "bestPaperNominee": 0
    },
    "cscw672": {
        "title": "The Virtuous Circle of Wikipedia: Recursive Measures of Collaboration Structures",
        "abstract": "In open collaboration, knowledge is created and iteratively improved by a multitude of editors, who freely choose what should be their contributions. The quality of knowledge artifacts (e.g. article, source code file) is deeply tied to their individual expertise, and to their ability to achieve collaboration. Conversely, the expertise of contributors is a function of artifacts contributed to. Building upon a large stream of literature on the measurement of article quality and contributor expertise, we propose a recursive algorithm to measure how editor expertise influences the quality of articles, and how contributions to articles influence editor expertise. This bi-partite network random walker metric reveals the specific structure of cooperation and how the quality of articles is achieved through coordination. We show that while the wisdom of crowds is well pulled in some categories, more editors per article can also create disvalue.",
        "keywords": "",
        "authors": [
            {
                "name": "Maximilian Klein"
            },
            {
                "name": "Thomas Maillart"
            },
            {
                "name": "John Chuang"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw673": {
        "title": "Risk-taking as a Learning Process for Shaping  Teen's Online Information Privacy Behaviors",
        "abstract": "Through a secondary data analysis of a nationally representative Pew survey [35-36], we empirically test the validity of two contrasting theoretical models of adolescent information privacy behaviors. Our results suggest that in seeking to understand the underlying processes of teens' privacy risk-taking and risk-coping behaviors within social media, a \"risk-centric\" framework may be more useful than a traditional \"concern-centric\" framework that emphasizes privacy antecedents and outcomes. Our newly proposed and validated \"risk-centric\" framework implies a possible risk escalation process wherein teens make online disclosures and render themselves more susceptible to experiences of risky online interactions; in turn, these risky experiences are associated with higher levels of teen privacy concern. Higher levels of teen privacy concern predict both advice-seeking and remedy/corrective risk-coping behaviors. Drawing on theories of information privacy and developmental psychology, we discuss these findings from the perspective of allowing teens to experience some level of online risk so that they can learn how to navigate the dangers and reap the benefits of online engagement.",
        "keywords": "",
        "authors": [
            {
                "name": "Haiyan Jia"
            },
            {
                "name": "Pamela J Wisniewski"
            },
            {
                "name": "Heng Xu"
            },
            {
                "name": "Mary Beth Rosson"
            },
            {
                "name": "John M Carroll"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw677": {
        "title": "Making Decisions From a Distance: The Impact of Technological Mediation on Riskiness and Dehumanization in Decision Making",
        "abstract": "Telepresence means business people can make deals in other countries, doctors can give remote medical advice, and soldiers can rescue someone from thousands of miles away. When interaction is mediated, people are removed from and lack context about the person they are making decisions about. In this paper, we explore the impact of technological mediation on risk and dehumanization in decision-making. We conducted a laboratory experiment involving medical treatment decisions. The results suggest that technological mediation influences decision making, but its influence depends on an individual's self-construal: participants who saw themselves as defined through their relationships (interdependent self-construal) recommended riskier and more painful treatments in video conferencing than when face-to-face. We discuss implications of our results for theory and future research.",
        "keywords": "",
        "authors": [
            {
                "name": "Min Kyung Lee"
            },
            {
                "name": "Laura Dabbish"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw679": {
        "title": "Coercing for completeness in financial advisory service encounters",
        "abstract": "In this article we report on design insights found during the evaluation of an innovative IT-artifact to support financial service encounters. Relating to previous work in this field, we carefully designed the artifact to omit any visualization and enforcement of rigid process structures as those had turned out to be harmful. Our main design element was a mind-map-like content hierarchy to capture the client's situation. Surprisingly we noticed that both, clients and advisors, talked about every information item visible on the screen just for the sake of completeness. They also followed a sequential process apparently inferred from the content hierarchy. We call this phenomenon \"coercing for completeness\". This phenomenon negatively influences the conversation between client and advisor inducing shorter discussion units and sudden, incomprehensible topic shifts. This article contributes an exploration of this phenomenon and its effects onto the collaborative setting.",
        "keywords": "",
        "authors": [
            {
                "name": "Mehmet Kilic"
            },
            {
                "name": "Peter Heinrich"
            },
            {
                "name": "Gerhard Schwabe"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw681": {
        "title": "The Diffusion of Support in an Online Social Movement: Evidence from the Adoption of Equal-Sign Profile Pictures",
        "abstract": "In March of 2013, 3 million Facebook users changed their profile picture to one of an equals sign to demonstrate support of same-sex marriage. We demonstrate that this action shows complex diffusion characteristics congruent with threshold models, with most users observing several of their friends changing their profile picture before taking the action themselves. While the number of friends played a role in the adoption dynamics, so did demographic characteristics and the general propensity of the individual to change their profile picture. We show via simulation that the adoption curve is consistent with a heterogeneous-threshold model, in which the probability of adoption depends on both the number of friends and the susceptibility of the individual.",
        "keywords": "",
        "authors": [
            {
                "name": "Bogdan State"
            },
            {
                "name": "Lada A Adamic"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw685": {
        "title": "Digital Entanglements: Craft, Computation and Collaboration in Fine Art Furniture Production",
        "abstract": "This paper joins a growing body of CSCW and HCI work exploring questions of creativity and collaboration as enacted in and through a world of things. Drawing on studio visits and interviews with fine art furniture maker Wendell Castle and his team of craftsmen, we investigate one studio's experience with integrating digital fabrication tools into their studio practice, and its implications for the organization of work and creativity in predominantly craft-based practices.We argue that the line between object and social life is more complex than simple divisions allow, and that the introduction of new computational and industrial machine objects (here, Computer Numerical Controllers) may reshape traditional relations of craftmaking and the forms of value, care, and creativity built around them. We point to new forms of creative practice and material flows that may emerge from this encounter, and reflect on the questions and opportunities that Castle's sociotechnical practice may pose for wider CSCW concerns around craft, creativity, and design.",
        "keywords": "",
        "authors": [
            {
                "name": "Amy Cheatle"
            },
            {
                "name": "Steven Jackson"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw686": {
        "title": "Open Education in the Wild: The Dynamics of Course Production in the Peer 2 Peer University",
        "abstract": "The Peer 2 Peer University (P2PU) is an online, open education platform where any user can create a course, contribute content, or join an existing course as a learner. P2PU represents an experiment in organizing the production of entirely user-generated, open education. However, the open model of P2PU rests on the critical assumption that members can successfully coordinate and produce a sufficient supply of courses and motivate others to join in. In this paper, we use log data from P2PU to describe the dynamics of organizers -- members who try to produce and launch open courses -- and explore the factors related to their ability to successfully create courses on this open platform. We find that a critical predictor of successful course development is quickly finding like-minded organizers to collaborate with, suggesting that creating new education systems based on open, social computing platforms requires facilitation of key aspects of social coordination beyond providing platform and content resources.",
        "keywords": "",
        "authors": [
            {
                "name": "June Ahn"
            },
            {
                "name": "Sarah A Webster"
            },
            {
                "name": "Brian Butler"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw687": {
        "title": "\"Preventative\" vs. \"Reactive:\" How Parental Mediation Influences Teens' Social Media Privacy Behaviors",
        "abstract": "Through an empirical, secondary analysis of 588 teens (ages 12-17) and one of their parents living in the United States, we present useful insights into how parental privacy concerns for their teens and different parental mediation strategies (direct intervention versus active mediation) influence teen privacy concerns and privacy risk-taking and risk-coping privacy behaviors in social media. Our results suggest that the use of direct intervention by itself may have a suppressive effect on teens, reducing their exposure to online risks but also their ability to engage with others online and to learn how to effective cope with online risks. Therefore, it may be beneficial for parents to combine active mediation with direct intervention so that they can protect their teens from severe online risks while empowering teens to engage with others online and learn to make good online privacy choices.",
        "keywords": "",
        "authors": [
            {
                "name": "Pamela J Wisniewski"
            },
            {
                "name": "Haiyan Jia"
            },
            {
                "name": "Heng Xu"
            },
            {
                "name": "Mary Beth Rosson"
            },
            {
                "name": "John M Carroll"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw707": {
        "title": "Friendship maintenance in the age of Facebook: Strategies of self-disclosure in online social media",
        "abstract": "CSCW research has explored mobile technologies to support social activity on the go to produce greater feelings of con-nectedness. Much of this has focused on different mobile devices, individual preferences and modes of use. Yet social activity and connectedness are about ongoing enactments of relationships across technologies. In this paper we propose a focus on friends and friendship maintenance in addition to individual preferences in the design and analysis of mobile communication technologies. We discuss three strategies people use to manage tensions in their friendships: selec-tion, segmentation and integration. Our data show that use of social technologies can at times destabilize social rela-tions and occasion relational tensions, forcing users to rene-gotiate how they enact these relationships. ",
        "keywords": "",
        "authors": [
            {
                "name": "Irina A Shklovski"
            },
            {
                "name": "Louise Barkhuus"
            },
            {
                "name": "Nis Bornoe"
            },
            {
                "name": "Jofish Kaye"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw714": {
        "title": "Participatory Militias: A Case Study of the Mexican Self-Defense Militias and their Online Audience",
        "abstract": "Armed groups of civilians, known as the \"self-defense militias,\" have ousted powerful drug cartels from several Mexican towns. This militia uprising has unfolded on social media, in particular in a Facebook page reaching almost 160,000 fans.  Unlike previously documented uses of social media in the Mexican Drug War,  the page not only posts reports of the violent clashes, but it also plays a pro-militia propagandistic role, and engages in two-way communication with its audience. This work presents a descriptive analysis of VXM and its audience. We examine the full 6,000 posts by the VXM administrators, and more than 108,000 comments by their fans. We extract themes, post frequency, and its relationship with offline events and public figures. We argue that VXM presents a novel form of participatory propaganda online that helps people make sense of the violence, and, in some cases, foster offline collective action. We conclude by discussing possible applications of these findings for the design of civic engagement technologies.",
        "keywords": "",
        "authors": [
            {
                "name": "Saiph Savage"
            },
            {
                "name": "Andres Monroy-Hernandez"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw717": {
        "title": "Don't Wait! How Timing Affects Coordination of Crowdfunding Donations",
        "abstract": "Crowdfunding sites often impose deadlines for projects to receive their requested funds. This deadline structure creates a difficult decision for potential donors. Donors can donate early to a project to help it reach its goal and to signal to other donors that the project is worthwhile. But donors may also want to wait for a similar signal from others. We conduct an experimental simulation of a crowdfunding website to explore how potential donors to projects make this decision. We find evidence for both strategies in our experiment; some donate early while others wait till the last second. However, we also find that making an early donation is usually a better strategy for donors because the amount of donations made early in a project's campaign is often the only difference between that project being funded or not. This finding suggests that crowdfunding sites need to develop designs, policies and incentives that encourage people to make immediate donations so that the site can most efficiently fund projects.",
        "keywords": "",
        "authors": [
            {
                "name": "Jacob Solomon"
            },
            {
                "name": "Wenjuan Ma"
            },
            {
                "name": "Rick Wash"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw723": {
        "title": "Social Sharing of Emotions on Facebook: Channel Differences, Satisfaction, and Replies",
        "abstract": "People often share emotions with others in order to manage their emotional experiences. We investigate how social media properties such as visibility and directedness affect how people share emotions in Facebook and their satisfaction after doing so. 141 participants rated 1,628 of their own recent status updates, posts they made on others' walls, and private messages they sent for intensity, valence, personal relevance, and overall satisfaction they felt after sharing each message. For network-visible channels -- status updates and posts on others' walls -- they also rated their satisfaction with replies they received. People shared differently between channels, with more intense and negative emotions in private messages. People feel more satisfied after sharing more positive emotions in all channels and after sharing more personally relevant emotions in network-visible channels. Finally, people's overall satisfaction after sharing emotions in network-visible channels is strongly tied to their reply satisfaction. Quality of replies, not just quantity, matters, suggesting the need for designs that help people receive valuable responses to their shared emotions.",
        "keywords": "",
        "authors": [
            {
                "name": "Natalya N Bazarova"
            },
            {
                "name": "Yoon Hyung Choi"
            },
            {
                "name": "Victoria Schwanda Sosik"
            },
            {
                "name": "Dan Cosley"
            },
            {
                "name": "Janis Whitlock"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw736": {
        "title": "Anticipation Work: Cultivating Vision in Collective Practice",
        "abstract": "This paper joins a growing body of CSCW and HCI work addressing problems of temporality in large-scale collaborative work. Drawing on ethnographic fieldwork around large-scale infrastructure development in ecology and ocean science, and analyses of futurism in science and technology studies, we call attention to \"anticipation work\": the practices that cultivate and channel expectations of the future, design pathways into those imaginations, and maintain those visions in the face of a dynamic world. We advance three basic claims: first, that long term technological development and sustainability in science is guided by complex and distributed forms of futurism; second, that all actors (both individual and collective) orient towards the future (at both temporally close and distant scales); and third, that actors engage in complex and skilled forms of anticipation work -- individual and collective, formal and informal -- that guide and shape the present character and experience of collaborative life.",
        "keywords": "",
        "authors": [
            {
                "name": "Stephanie B Steinhardt"
            },
            {
                "name": "Steven J Jackson"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 1
    },
    "cscw749": {
        "title": "Engagement and Well-being on Social Network Sites",
        "abstract": "Prior research reported contradictory findings on the relationship between SNS use and psychological well-being. We address this shortcoming by incorporating a finer measure of SNS user engagement and hypothesizing U-shaped rather than purely linear relationships. We tested our hypotheses via a Web based questionnaire administered to 289 Facebook users. Ordinary least squares approach confirmed the hypothesized U-shaped relationship. Our findings further show that User Engagement, and in turn well-being, is associated with the number of SNS friends. These findings suggest that well-being derived from SNS usage could be optimized by avoiding underuse as well as overuse.",
        "keywords": "",
        "authors": [
            {
                "name": "A.K.M. Najmul Islam"
            },
            {
                "name": "Sameer Patil"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "cscw753": {
        "title": "The Importance of Publicly Available Social Networking Sites (SNSs) to Entrepreneurs",
        "abstract": "This study examines the use of social networking sites (SNSs) such as Facebook and LinkedIn by entrepreneurs in small companies of fewer than 10 employees. The findings show that entrepreneurs use SNSs in many of the same ways that workers in large companies do. This investigation into the activities conducted through SNSs by entrepreneurs in small companies contributes to the growing body of research on SNS use in the workplace. ",
        "keywords": "",
        "authors": [
            {
                "name": "Toni D Ferro"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "tochi101": {
        "title": "E-Government Intermediaries and the Challenges of Access and Trust",
        "abstract": "In this paper, we present the results of a study examining challenges related to access and trust for nutrition assistance outreach workers and suggest design implications for these challenges. Outreach workers are e-government intermediaries who assist clients with accessing and using e-government online applications, systems, and services. E-government intermediaries are not typical end users, but use e-government systems on behalf of clients, and as such their challenges differ from those of primary users. We detail social and technical aspects of these challenges develop a nuanced understanding of access and trust in the ecosystems surrounding e-government systems. First, we describe how the practical accomplishment of access involves multiple stakeholders, actors, and practices. Second, we highlight how trust emerges through the e-government intermediaries' work to project themselves as professional and competent through their technical practice. Last, we propose design implications sensitive to both the social and technical aspects of these challenges.",
        "keywords": "",
        "authors": [
            {
                "name": "Lynn S Dombrowski"
            },
            {
                "name": "Gillian Hayes"
            },
            {
                "name": "Melissa Mazmanian"
            },
            {
                "name": "Amy Voida"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "tochi102": {
        "title": "Reciprocal Habituation: A Study of Older People and the Kinect",
        "abstract": "We explore relationships between habits and technology interaction by reporting on older people's experience of the Kinect for Xbox. We contribute to theoretical and empirical understandings of habits in the use of technology to inform understanding of the habitual qualities of our interactions with computing technologies, particularly systems exploiting natural user interfaces. We situate ideas of habit in relation to user experience and usefulness in interaction design; and draw on critical approaches to the concept of habit from cultural theory to understand the embedded, embodied and situated contexts in our interactions with technologies. We argue that understanding technology habits as a process of reciprocal habituation in which people and technologies adapt to each other over time through design, adoption and appropriation offers opportunities for research on user experience and interaction design within HCI, especially as newer gestural and motion control interfaces promise to reshape the ways we interact with computers.",
        "keywords": "",
        "authors": [
            {
                "name": "Bjorn Nansen"
            },
            {
                "name": "Frank Vetere"
            },
            {
                "name": "Toni Robertson"
            },
            {
                "name": "John Downs"
            },
            {
                "name": "Margot Brereton"
            },
            {
                "name": "Jeannette Durick"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    },
    "tochi103": {
        "title": "Estrellita: A Mobile Capture and Access Tool for the Support of Preterm Infants and their Caregivers",
        "abstract": "In this paper, we describe the design process and principles used in the development of a tool to support parents of preterm infants to track health data, Estrellita. We tested Estrellita in the homes of seven families for four months, while following seven additional families without Estrellita. The feedback from this trial, including in-depth interviews, surveys, and log analysis, sheds light on how parents can use a mobile data collection tool to enhance their problem-solving processes about their own health and that of their infants, as well as to share with others who support them in this care. In addition to presenting the design of a recording technology for preterm infants and its use in a real-life setting, the results of this research provide a deep understanding of how technology can and should be used to support home-care of at-risk patients, in which data capture may be unexpected but essential.",
        "keywords": "",
        "authors": [
            {
                "name": "Gillian Hayes"
            },
            {
                "name": "Karen Cheng"
            },
            {
                "name": "Sen Hirano"
            },
            {
                "name": "Karen Tang"
            },
            {
                "name": "Marni Nagel"
            },
            {
                "name": "Dianne Baker"
            }
        ],
        "type": "paper",
        "subtype": "paper",
        "bestPaperAward": 0,
        "bestPaperNominee": 0
    }
}
